{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Esercizi Neo4j.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "b1vt5jhzZa8I"
      },
      "source": [
        "**Esercizi Neo4j**"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "r9sFh0jGIM93",
        "outputId": "cf7c2f7b-4edf-461d-f4af-b1079991788f"
      },
      "source": [
        "!pip install neo4j-driver"
      ],
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting neo4j-driver\n",
            "  Downloading neo4j-driver-4.4.0.tar.gz (89 kB)\n",
            "\u001b[?25l\r\u001b[K     |███▊                            | 10 kB 25.6 MB/s eta 0:00:01\r\u001b[K     |███████▍                        | 20 kB 29.0 MB/s eta 0:00:01\r\u001b[K     |███████████                     | 30 kB 12.1 MB/s eta 0:00:01\r\u001b[K     |██████████████▊                 | 40 kB 9.1 MB/s eta 0:00:01\r\u001b[K     |██████████████████▍             | 51 kB 5.2 MB/s eta 0:00:01\r\u001b[K     |██████████████████████          | 61 kB 5.3 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▊      | 71 kB 5.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▍  | 81 kB 6.1 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 89 kB 3.8 MB/s \n",
            "\u001b[?25hRequirement already satisfied: pytz in /usr/local/lib/python3.7/dist-packages (from neo4j-driver) (2018.9)\n",
            "Building wheels for collected packages: neo4j-driver\n",
            "  Building wheel for neo4j-driver (setup.py) ... \u001b[?25l\u001b[?25hdone\n",
            "  Created wheel for neo4j-driver: filename=neo4j_driver-4.4.0-py3-none-any.whl size=114976 sha256=6e87ca482a2f54a96c57a71e89efb5c7b30e23b8f689a86121de7816d480055c\n",
            "  Stored in directory: /root/.cache/pip/wheels/5e/89/23/48d22f30bfad0866aac1078fb2e24db1dd3750c46198557ffe\n",
            "Successfully built neo4j-driver\n",
            "Installing collected packages: neo4j-driver\n",
            "Successfully installed neo4j-driver-4.4.0\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "yZD-pSnLIjfQ"
      },
      "source": [
        "from neo4j import GraphDatabase, basic_auth\n",
        "from pandas import DataFrame"
      ],
      "execution_count": 2,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "FVuqG8vlIj7v"
      },
      "source": [
        "driver = GraphDatabase.driver(\"neo4j+s://bf4aea1f.databases.neo4j.io\", auth=basic_auth(\"neo4j\", \"7EXjJCi2K_Qy2emaWMIAwd0Bwqr07yNxMaQc1FDr25I\"))"
      ],
      "execution_count": 3,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "9WDwDfr0JY9o"
      },
      "source": [
        "Prendere in considerazione il database Movies e scrivere in un file word le istruzioni Cypher per estrarre le seguenti informazioni:"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "esPrYtnKJK7m",
        "outputId": "3ef7d1c2-1eb9-4c73-fa89-3f1301b95f13"
      },
      "source": [
        "# 0. tutto il database\n",
        "cypher_query = '''\n",
        "MATCH (a) \n",
        "RETURN a\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 4,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'a': {'released': 1999,\n",
              "   'tagline': 'Welcome to the Real World',\n",
              "   'title': 'The Matrix'}},\n",
              " {'a': {'born': 1964, 'name': 'Keanu Reeves'}},\n",
              " {'a': {'born': 1967, 'name': 'Carrie-Anne Moss'}},\n",
              " {'a': {'born': 1961, 'name': 'Laurence Fishburne'}},\n",
              " {'a': {'born': 1960, 'name': 'Hugo Weaving'}},\n",
              " {'a': {'born': 1967, 'name': 'Lilly Wachowski'}},\n",
              " {'a': {'born': 1965, 'name': 'Lana Wachowski'}},\n",
              " {'a': {'born': 1952, 'name': 'Joel Silver'}},\n",
              " {'a': {'born': 1978, 'name': 'Emil Eifrem'}},\n",
              " {'a': {'released': 2003,\n",
              "   'tagline': 'Free your mind',\n",
              "   'title': 'The Matrix Reloaded'}},\n",
              " {'a': {'released': 2003,\n",
              "   'tagline': 'Everything that has a beginning has an end',\n",
              "   'title': 'The Matrix Revolutions'}},\n",
              " {'a': {'released': 1997,\n",
              "   'tagline': 'Evil has its winning ways',\n",
              "   'title': \"The Devil's Advocate\"}},\n",
              " {'a': {'born': 1975, 'name': 'Charlize Theron'}},\n",
              " {'a': {'born': 1940, 'name': 'Al Pacino'}},\n",
              " {'a': {'born': 1944, 'name': 'Taylor Hackford'}},\n",
              " {'a': {'released': 1992,\n",
              "   'tagline': \"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\",\n",
              "   'title': 'A Few Good Men'}},\n",
              " {'a': {'born': 1962, 'name': 'Tom Cruise'}},\n",
              " {'a': {'born': 1937, 'name': 'Jack Nicholson'}},\n",
              " {'a': {'born': 1962, 'name': 'Demi Moore'}},\n",
              " {'a': {'born': 1958, 'name': 'Kevin Bacon'}},\n",
              " {'a': {'born': 1966, 'name': 'Kiefer Sutherland'}},\n",
              " {'a': {'born': 1971, 'name': 'Noah Wyle'}},\n",
              " {'a': {'born': 1968, 'name': 'Cuba Gooding Jr.'}},\n",
              " {'a': {'born': 1957, 'name': 'Kevin Pollak'}},\n",
              " {'a': {'born': 1943, 'name': 'J.T. Walsh'}},\n",
              " {'a': {'born': 1967, 'name': 'James Marshall'}},\n",
              " {'a': {'born': 1948, 'name': 'Christopher Guest'}},\n",
              " {'a': {'born': 1947, 'name': 'Rob Reiner'}},\n",
              " {'a': {'born': 1961, 'name': 'Aaron Sorkin'}},\n",
              " {'a': {'released': 1986,\n",
              "   'tagline': 'I feel the need, the need for speed.',\n",
              "   'title': 'Top Gun'}},\n",
              " {'a': {'born': 1957, 'name': 'Kelly McGillis'}},\n",
              " {'a': {'born': 1959, 'name': 'Val Kilmer'}},\n",
              " {'a': {'born': 1962, 'name': 'Anthony Edwards'}},\n",
              " {'a': {'born': 1933, 'name': 'Tom Skerritt'}},\n",
              " {'a': {'born': 1961, 'name': 'Meg Ryan'}},\n",
              " {'a': {'born': 1944, 'name': 'Tony Scott'}},\n",
              " {'a': {'born': 1941, 'name': 'Jim Cash'}},\n",
              " {'a': {'released': 2000,\n",
              "   'tagline': 'The rest of his life begins now.',\n",
              "   'title': 'Jerry Maguire'}},\n",
              " {'a': {'born': 1969, 'name': 'Renee Zellweger'}},\n",
              " {'a': {'born': 1962, 'name': 'Kelly Preston'}},\n",
              " {'a': {'born': 1974, 'name': \"Jerry O'Connell\"}},\n",
              " {'a': {'born': 1970, 'name': 'Jay Mohr'}},\n",
              " {'a': {'born': 1961, 'name': 'Bonnie Hunt'}},\n",
              " {'a': {'born': 1971, 'name': 'Regina King'}},\n",
              " {'a': {'born': 1996, 'name': 'Jonathan Lipnicki'}},\n",
              " {'a': {'born': 1957, 'name': 'Cameron Crowe'}},\n",
              " {'a': {'released': 1986,\n",
              "   'tagline': \"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\",\n",
              "   'title': 'Stand By Me'}},\n",
              " {'a': {'born': 1970, 'name': 'River Phoenix'}},\n",
              " {'a': {'born': 1971, 'name': 'Corey Feldman'}},\n",
              " {'a': {'born': 1972, 'name': 'Wil Wheaton'}},\n",
              " {'a': {'born': 1966, 'name': 'John Cusack'}},\n",
              " {'a': {'born': 1942, 'name': 'Marshall Bell'}},\n",
              " {'a': {'released': 1997,\n",
              "   'tagline': 'A comedy from the heart that goes for the throat.',\n",
              "   'title': 'As Good as It Gets'}},\n",
              " {'a': {'born': 1963, 'name': 'Helen Hunt'}},\n",
              " {'a': {'born': 1963, 'name': 'Greg Kinnear'}},\n",
              " {'a': {'born': 1940, 'name': 'James L. Brooks'}},\n",
              " {'a': {'released': 1998,\n",
              "   'tagline': 'After life there is more. The end is just the beginning.',\n",
              "   'title': 'What Dreams May Come'}},\n",
              " {'a': {'born': 1960, 'name': 'Annabella Sciorra'}},\n",
              " {'a': {'born': 1929, 'name': 'Max von Sydow'}},\n",
              " {'a': {'born': 1942, 'name': 'Werner Herzog'}},\n",
              " {'a': {'born': 1951, 'name': 'Robin Williams'}},\n",
              " {'a': {'born': 1956, 'name': 'Vincent Ward'}},\n",
              " {'a': {'released': 1999,\n",
              "   'tagline': 'First loves last. Forever.',\n",
              "   'title': 'Snow Falling on Cedars'}},\n",
              " {'a': {'born': 1970, 'name': 'Ethan Hawke'}},\n",
              " {'a': {'born': 1971, 'name': 'Rick Yune'}},\n",
              " {'a': {'born': 1940, 'name': 'James Cromwell'}},\n",
              " {'a': {'born': 1953, 'name': 'Scott Hicks'}},\n",
              " {'a': {'released': 1998,\n",
              "   'tagline': 'At odds in life... in love on-line.',\n",
              "   'title': \"You've Got Mail\"}},\n",
              " {'a': {'born': 1968, 'name': 'Parker Posey'}},\n",
              " {'a': {'born': 1973, 'name': 'Dave Chappelle'}},\n",
              " {'a': {'born': 1967, 'name': 'Steve Zahn'}},\n",
              " {'a': {'born': 1956, 'name': 'Tom Hanks'}},\n",
              " {'a': {'born': 1941, 'name': 'Nora Ephron'}},\n",
              " {'a': {'released': 1993,\n",
              "   'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?',\n",
              "   'title': 'Sleepless in Seattle'}},\n",
              " {'a': {'born': 1956, 'name': 'Rita Wilson'}},\n",
              " {'a': {'born': 1953, 'name': 'Bill Pullman'}},\n",
              " {'a': {'born': 1949, 'name': 'Victor Garber'}},\n",
              " {'a': {'born': 1962, 'name': \"Rosie O'Donnell\"}},\n",
              " {'a': {'released': 1990,\n",
              "   'tagline': 'A story of love, lava and burning desire.',\n",
              "   'title': 'Joe Versus the Volcano'}},\n",
              " {'a': {'born': 1950, 'name': 'John Patrick Stanley'}},\n",
              " {'a': {'born': 1956, 'name': 'Nathan Lane'}},\n",
              " {'a': {'released': 1998,\n",
              "   'tagline': 'Can two friends sleep together and still love each other in the morning?',\n",
              "   'title': 'When Harry Met Sally'}},\n",
              " {'a': {'born': 1948, 'name': 'Billy Crystal'}},\n",
              " {'a': {'born': 1956, 'name': 'Carrie Fisher'}},\n",
              " {'a': {'born': 1949, 'name': 'Bruno Kirby'}},\n",
              " {'a': {'released': 1996,\n",
              "   'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
              "   'title': 'That Thing You Do'}},\n",
              " {'a': {'born': 1977, 'name': 'Liv Tyler'}},\n",
              " {'a': {'released': 2000,\n",
              "   'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever',\n",
              "   'title': 'The Replacements'}},\n",
              " {'a': {'born': 1970, 'name': 'Brooke Langton'}},\n",
              " {'a': {'born': 1930, 'name': 'Gene Hackman'}},\n",
              " {'a': {'born': 1968, 'name': 'Orlando Jones'}},\n",
              " {'a': {'born': 1950, 'name': 'Howard Deutch'}},\n",
              " {'a': {'released': 2006,\n",
              "   'tagline': \"Based on the extraordinary true story of one man's fight for freedom\",\n",
              "   'title': 'RescueDawn'}},\n",
              " {'a': {'born': 1974, 'name': 'Christian Bale'}},\n",
              " {'a': {'born': 1954, 'name': 'Zach Grenier'}},\n",
              " {'a': {'released': 1996,\n",
              "   'tagline': 'Come as you are',\n",
              "   'title': 'The Birdcage'}},\n",
              " {'a': {'born': 1931, 'name': 'Mike Nichols'}},\n",
              " {'a': {'released': 1992,\n",
              "   'tagline': \"It's a hell of a thing, killing a man\",\n",
              "   'title': 'Unforgiven'}},\n",
              " {'a': {'born': 1930, 'name': 'Richard Harris'}},\n",
              " {'a': {'born': 1930, 'name': 'Clint Eastwood'}},\n",
              " {'a': {'released': 1995,\n",
              "   'tagline': 'The hottest data on earth. In the coolest head in town',\n",
              "   'title': 'Johnny Mnemonic'}},\n",
              " {'a': {'born': 1947, 'name': 'Takeshi Kitano'}},\n",
              " {'a': {'born': 1968, 'name': 'Dina Meyer'}},\n",
              " {'a': {'born': 1958, 'name': 'Ice-T'}},\n",
              " {'a': {'born': 1953, 'name': 'Robert Longo'}},\n",
              " {'a': {'released': 2012,\n",
              "   'tagline': 'Everything is connected',\n",
              "   'title': 'Cloud Atlas'}},\n",
              " {'a': {'born': 1966, 'name': 'Halle Berry'}},\n",
              " {'a': {'born': 1949, 'name': 'Jim Broadbent'}},\n",
              " {'a': {'born': 1965, 'name': 'Tom Tykwer'}},\n",
              " {'a': {'born': 1969, 'name': 'David Mitchell'}},\n",
              " {'a': {'born': 1961, 'name': 'Stefan Arndt'}},\n",
              " {'a': {'released': 2006,\n",
              "   'tagline': 'Break The Codes',\n",
              "   'title': 'The Da Vinci Code'}},\n",
              " {'a': {'born': 1939, 'name': 'Ian McKellen'}},\n",
              " {'a': {'born': 1976, 'name': 'Audrey Tautou'}},\n",
              " {'a': {'born': 1971, 'name': 'Paul Bettany'}},\n",
              " {'a': {'born': 1954, 'name': 'Ron Howard'}},\n",
              " {'a': {'released': 2006,\n",
              "   'tagline': 'Freedom! Forever!',\n",
              "   'title': 'V for Vendetta'}},\n",
              " {'a': {'born': 1981, 'name': 'Natalie Portman'}},\n",
              " {'a': {'born': 1946, 'name': 'Stephen Rea'}},\n",
              " {'a': {'born': 1940, 'name': 'John Hurt'}},\n",
              " {'a': {'born': 1967, 'name': 'Ben Miles'}},\n",
              " {'a': {'released': 2008,\n",
              "   'tagline': 'Speed has no limits',\n",
              "   'title': 'Speed Racer'}},\n",
              " {'a': {'born': 1985, 'name': 'Emile Hirsch'}},\n",
              " {'a': {'born': 1960, 'name': 'John Goodman'}},\n",
              " {'a': {'born': 1946, 'name': 'Susan Sarandon'}},\n",
              " {'a': {'born': 1966, 'name': 'Matthew Fox'}},\n",
              " {'a': {'born': 1980, 'name': 'Christina Ricci'}},\n",
              " {'a': {'born': 1982, 'name': 'Rain'}},\n",
              " {'a': {'released': 2009,\n",
              "   'tagline': 'Prepare to enter a secret world of assassins',\n",
              "   'title': 'Ninja Assassin'}},\n",
              " {'a': {'name': 'Naomie Harris'}},\n",
              " {'a': {'released': 1999,\n",
              "   'tagline': \"Walk a mile you'll never forget.\",\n",
              "   'title': 'The Green Mile'}},\n",
              " {'a': {'born': 1957, 'name': 'Michael Clarke Duncan'}},\n",
              " {'a': {'born': 1953, 'name': 'David Morse'}},\n",
              " {'a': {'born': 1968, 'name': 'Sam Rockwell'}},\n",
              " {'a': {'born': 1955, 'name': 'Gary Sinise'}},\n",
              " {'a': {'born': 1959, 'name': 'Patricia Clarkson'}},\n",
              " {'a': {'born': 1959, 'name': 'Frank Darabont'}},\n",
              " {'a': {'released': 2008,\n",
              "   'tagline': '400 million people were waiting for the truth.',\n",
              "   'title': 'Frost/Nixon'}},\n",
              " {'a': {'born': 1938, 'name': 'Frank Langella'}},\n",
              " {'a': {'born': 1969, 'name': 'Michael Sheen'}},\n",
              " {'a': {'born': 1960, 'name': 'Oliver Platt'}},\n",
              " {'a': {'released': 1992,\n",
              "   'tagline': \"He didn't want law. He wanted justice.\",\n",
              "   'title': 'Hoffa'}},\n",
              " {'a': {'born': 1944, 'name': 'Danny DeVito'}},\n",
              " {'a': {'born': 1965, 'name': 'John C. Reilly'}},\n",
              " {'a': {'released': 1995,\n",
              "   'tagline': 'Houston, we have a problem.',\n",
              "   'title': 'Apollo 13'}},\n",
              " {'a': {'born': 1950, 'name': 'Ed Harris'}},\n",
              " {'a': {'born': 1955, 'name': 'Bill Paxton'}},\n",
              " {'a': {'released': 1996,\n",
              "   'tagline': \"Don't Breathe. Don't Look Back.\",\n",
              "   'title': 'Twister'}},\n",
              " {'a': {'born': 1967, 'name': 'Philip Seymour Hoffman'}},\n",
              " {'a': {'born': 1943, 'name': 'Jan de Bont'}},\n",
              " {'a': {'released': 2000,\n",
              "   'tagline': 'At the edge of the world, his journey begins.',\n",
              "   'title': 'Cast Away'}},\n",
              " {'a': {'born': 1951, 'name': 'Robert Zemeckis'}},\n",
              " {'a': {'released': 1975,\n",
              "   'tagline': \"If he's crazy, what does that make you?\",\n",
              "   'title': \"One Flew Over the Cuckoo's Nest\"}},\n",
              " {'a': {'born': 1932, 'name': 'Milos Forman'}},\n",
              " {'a': {'released': 2003, 'title': \"Something's Gotta Give\"}},\n",
              " {'a': {'born': 1946, 'name': 'Diane Keaton'}},\n",
              " {'a': {'born': 1949, 'name': 'Nancy Meyers'}},\n",
              " {'a': {'released': 1999,\n",
              "   'tagline': \"One robot's 200 year journey to become an ordinary man.\",\n",
              "   'title': 'Bicentennial Man'}},\n",
              " {'a': {'born': 1958, 'name': 'Chris Columbus'}},\n",
              " {'a': {'released': 2007,\n",
              "   'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\",\n",
              "   'title': \"Charlie Wilson's War\"}},\n",
              " {'a': {'born': 1967, 'name': 'Julia Roberts'}},\n",
              " {'a': {'released': 2004,\n",
              "   'tagline': 'This Holiday Season… Believe',\n",
              "   'title': 'The Polar Express'}},\n",
              " {'a': {'released': 1992,\n",
              "   'tagline': 'Once in a lifetime you get a chance to do something different.',\n",
              "   'title': 'A League of Their Own'}},\n",
              " {'a': {'born': 1954, 'name': 'Madonna'}},\n",
              " {'a': {'born': 1956, 'name': 'Geena Davis'}},\n",
              " {'a': {'born': 1963, 'name': 'Lori Petty'}},\n",
              " {'a': {'born': 1943, 'name': 'Penny Marshall'}},\n",
              " {'a': {'name': 'Paul Blythe'}},\n",
              " {'a': {'name': 'Angela Scope'}},\n",
              " {'a': {'name': 'Jessica Thompson'}},\n",
              " {'a': {'name': 'James Thompson'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 4
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "svFX22LjJj6I",
        "outputId": "0a170a20-2ba8-4f38-ba79-bc946d134fef"
      },
      "source": [
        "# 1. i film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 5,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m': {'released': 1999,\n",
              "   'tagline': 'Welcome to the Real World',\n",
              "   'title': 'The Matrix'}},\n",
              " {'m': {'released': 2003,\n",
              "   'tagline': 'Free your mind',\n",
              "   'title': 'The Matrix Reloaded'}},\n",
              " {'m': {'released': 2003,\n",
              "   'tagline': 'Everything that has a beginning has an end',\n",
              "   'title': 'The Matrix Revolutions'}},\n",
              " {'m': {'released': 1997,\n",
              "   'tagline': 'Evil has its winning ways',\n",
              "   'title': \"The Devil's Advocate\"}},\n",
              " {'m': {'released': 1992,\n",
              "   'tagline': \"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\",\n",
              "   'title': 'A Few Good Men'}},\n",
              " {'m': {'released': 1986,\n",
              "   'tagline': 'I feel the need, the need for speed.',\n",
              "   'title': 'Top Gun'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'The rest of his life begins now.',\n",
              "   'title': 'Jerry Maguire'}},\n",
              " {'m': {'released': 1986,\n",
              "   'tagline': \"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\",\n",
              "   'title': 'Stand By Me'}},\n",
              " {'m': {'released': 1997,\n",
              "   'tagline': 'A comedy from the heart that goes for the throat.',\n",
              "   'title': 'As Good as It Gets'}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'After life there is more. The end is just the beginning.',\n",
              "   'title': 'What Dreams May Come'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': 'First loves last. Forever.',\n",
              "   'title': 'Snow Falling on Cedars'}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'At odds in life... in love on-line.',\n",
              "   'title': \"You've Got Mail\"}},\n",
              " {'m': {'released': 1993,\n",
              "   'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?',\n",
              "   'title': 'Sleepless in Seattle'}},\n",
              " {'m': {'released': 1990,\n",
              "   'tagline': 'A story of love, lava and burning desire.',\n",
              "   'title': 'Joe Versus the Volcano'}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'Can two friends sleep together and still love each other in the morning?',\n",
              "   'title': 'When Harry Met Sally'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
              "   'title': 'That Thing You Do'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever',\n",
              "   'title': 'The Replacements'}},\n",
              " {'m': {'released': 2006,\n",
              "   'tagline': \"Based on the extraordinary true story of one man's fight for freedom\",\n",
              "   'title': 'RescueDawn'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': 'Come as you are',\n",
              "   'title': 'The Birdcage'}},\n",
              " {'m': {'released': 1992,\n",
              "   'tagline': \"It's a hell of a thing, killing a man\",\n",
              "   'title': 'Unforgiven'}},\n",
              " {'m': {'released': 1995,\n",
              "   'tagline': 'The hottest data on earth. In the coolest head in town',\n",
              "   'title': 'Johnny Mnemonic'}},\n",
              " {'m': {'released': 2012,\n",
              "   'tagline': 'Everything is connected',\n",
              "   'title': 'Cloud Atlas'}},\n",
              " {'m': {'released': 2006,\n",
              "   'tagline': 'Break The Codes',\n",
              "   'title': 'The Da Vinci Code'}},\n",
              " {'m': {'released': 2006,\n",
              "   'tagline': 'Freedom! Forever!',\n",
              "   'title': 'V for Vendetta'}},\n",
              " {'m': {'released': 2008,\n",
              "   'tagline': 'Speed has no limits',\n",
              "   'title': 'Speed Racer'}},\n",
              " {'m': {'released': 2009,\n",
              "   'tagline': 'Prepare to enter a secret world of assassins',\n",
              "   'title': 'Ninja Assassin'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': \"Walk a mile you'll never forget.\",\n",
              "   'title': 'The Green Mile'}},\n",
              " {'m': {'released': 2008,\n",
              "   'tagline': '400 million people were waiting for the truth.',\n",
              "   'title': 'Frost/Nixon'}},\n",
              " {'m': {'released': 1992,\n",
              "   'tagline': \"He didn't want law. He wanted justice.\",\n",
              "   'title': 'Hoffa'}},\n",
              " {'m': {'released': 1995,\n",
              "   'tagline': 'Houston, we have a problem.',\n",
              "   'title': 'Apollo 13'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': \"Don't Breathe. Don't Look Back.\",\n",
              "   'title': 'Twister'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'At the edge of the world, his journey begins.',\n",
              "   'title': 'Cast Away'}},\n",
              " {'m': {'released': 1975,\n",
              "   'tagline': \"If he's crazy, what does that make you?\",\n",
              "   'title': \"One Flew Over the Cuckoo's Nest\"}},\n",
              " {'m': {'released': 2003, 'title': \"Something's Gotta Give\"}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': \"One robot's 200 year journey to become an ordinary man.\",\n",
              "   'title': 'Bicentennial Man'}},\n",
              " {'m': {'released': 2007,\n",
              "   'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\",\n",
              "   'title': \"Charlie Wilson's War\"}},\n",
              " {'m': {'released': 2004,\n",
              "   'tagline': 'This Holiday Season… Believe',\n",
              "   'title': 'The Polar Express'}},\n",
              " {'m': {'released': 1992,\n",
              "   'tagline': 'Once in a lifetime you get a chance to do something different.',\n",
              "   'title': 'A League of Their Own'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 5
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FyKG7sCZKyrf",
        "outputId": "11dc47b2-6833-46f1-9ab3-858ce66dc1dc"
      },
      "source": [
        "# 2. i titoli dei film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.title': 'The Matrix'},\n",
              " {'m.title': 'The Matrix Reloaded'},\n",
              " {'m.title': 'The Matrix Revolutions'},\n",
              " {'m.title': \"The Devil's Advocate\"},\n",
              " {'m.title': 'A Few Good Men'},\n",
              " {'m.title': 'Top Gun'},\n",
              " {'m.title': 'Jerry Maguire'},\n",
              " {'m.title': 'Stand By Me'},\n",
              " {'m.title': 'As Good as It Gets'},\n",
              " {'m.title': 'What Dreams May Come'},\n",
              " {'m.title': 'Snow Falling on Cedars'},\n",
              " {'m.title': \"You've Got Mail\"},\n",
              " {'m.title': 'Sleepless in Seattle'},\n",
              " {'m.title': 'Joe Versus the Volcano'},\n",
              " {'m.title': 'When Harry Met Sally'},\n",
              " {'m.title': 'That Thing You Do'},\n",
              " {'m.title': 'The Replacements'},\n",
              " {'m.title': 'RescueDawn'},\n",
              " {'m.title': 'The Birdcage'},\n",
              " {'m.title': 'Unforgiven'},\n",
              " {'m.title': 'Johnny Mnemonic'},\n",
              " {'m.title': 'Cloud Atlas'},\n",
              " {'m.title': 'The Da Vinci Code'},\n",
              " {'m.title': 'V for Vendetta'},\n",
              " {'m.title': 'Speed Racer'},\n",
              " {'m.title': 'Ninja Assassin'},\n",
              " {'m.title': 'The Green Mile'},\n",
              " {'m.title': 'Frost/Nixon'},\n",
              " {'m.title': 'Hoffa'},\n",
              " {'m.title': 'Apollo 13'},\n",
              " {'m.title': 'Twister'},\n",
              " {'m.title': 'Cast Away'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\"},\n",
              " {'m.title': \"Something's Gotta Give\"},\n",
              " {'m.title': 'Bicentennial Man'},\n",
              " {'m.title': \"Charlie Wilson's War\"},\n",
              " {'m.title': 'The Polar Express'},\n",
              " {'m.title': 'A League of Their Own'}]"
            ]
          },
          "metadata": {},
          "execution_count": 11
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "kdL3KCfLKy03",
        "outputId": "61a30476-b499-4cb8-8d15-947a6e1bcfc3"
      },
      "source": [
        "# 3. i titoli dei film in ordine alfabetico\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title \n",
        "ORDER BY m.title\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 12,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.title': 'A Few Good Men'},\n",
              " {'m.title': 'A League of Their Own'},\n",
              " {'m.title': 'Apollo 13'},\n",
              " {'m.title': 'As Good as It Gets'},\n",
              " {'m.title': 'Bicentennial Man'},\n",
              " {'m.title': 'Cast Away'},\n",
              " {'m.title': \"Charlie Wilson's War\"},\n",
              " {'m.title': 'Cloud Atlas'},\n",
              " {'m.title': 'Frost/Nixon'},\n",
              " {'m.title': 'Hoffa'},\n",
              " {'m.title': 'Jerry Maguire'},\n",
              " {'m.title': 'Joe Versus the Volcano'},\n",
              " {'m.title': 'Johnny Mnemonic'},\n",
              " {'m.title': 'Ninja Assassin'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\"},\n",
              " {'m.title': 'RescueDawn'},\n",
              " {'m.title': 'Sleepless in Seattle'},\n",
              " {'m.title': 'Snow Falling on Cedars'},\n",
              " {'m.title': \"Something's Gotta Give\"},\n",
              " {'m.title': 'Speed Racer'},\n",
              " {'m.title': 'Stand By Me'},\n",
              " {'m.title': 'That Thing You Do'},\n",
              " {'m.title': 'The Birdcage'},\n",
              " {'m.title': 'The Da Vinci Code'},\n",
              " {'m.title': \"The Devil's Advocate\"},\n",
              " {'m.title': 'The Green Mile'},\n",
              " {'m.title': 'The Matrix'},\n",
              " {'m.title': 'The Matrix Reloaded'},\n",
              " {'m.title': 'The Matrix Revolutions'},\n",
              " {'m.title': 'The Polar Express'},\n",
              " {'m.title': 'The Replacements'},\n",
              " {'m.title': 'Top Gun'},\n",
              " {'m.title': 'Twister'},\n",
              " {'m.title': 'Unforgiven'},\n",
              " {'m.title': 'V for Vendetta'},\n",
              " {'m.title': 'What Dreams May Come'},\n",
              " {'m.title': 'When Harry Met Sally'},\n",
              " {'m.title': \"You've Got Mail\"}]"
            ]
          },
          "metadata": {},
          "execution_count": 12
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "uwzHkyl-KzB3",
        "outputId": "41b971c3-10eb-4ab9-9c89-55d89c5316fd"
      },
      "source": [
        "# 4. i titoli dei film dalla Z alla A\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title \n",
        "ORDER BY m.title DESC\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 23,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.title': \"You've Got Mail\"},\n",
              " {'m.title': 'When Harry Met Sally'},\n",
              " {'m.title': 'What Dreams May Come'},\n",
              " {'m.title': 'V for Vendetta'},\n",
              " {'m.title': 'Unforgiven'},\n",
              " {'m.title': 'Twister'},\n",
              " {'m.title': 'Top Gun'},\n",
              " {'m.title': 'The Replacements'},\n",
              " {'m.title': 'The Polar Express'},\n",
              " {'m.title': 'The Matrix Revolutions'},\n",
              " {'m.title': 'The Matrix Reloaded'},\n",
              " {'m.title': 'The Matrix'},\n",
              " {'m.title': 'The Green Mile'},\n",
              " {'m.title': \"The Devil's Advocate\"},\n",
              " {'m.title': 'The Da Vinci Code'},\n",
              " {'m.title': 'The Birdcage'},\n",
              " {'m.title': 'That Thing You Do'},\n",
              " {'m.title': 'Stand By Me'},\n",
              " {'m.title': 'Speed Racer'},\n",
              " {'m.title': \"Something's Gotta Give\"},\n",
              " {'m.title': 'Snow Falling on Cedars'},\n",
              " {'m.title': 'Sleepless in Seattle'},\n",
              " {'m.title': 'RescueDawn'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\"},\n",
              " {'m.title': 'Ninja Assassin'},\n",
              " {'m.title': 'Johnny Mnemonic'},\n",
              " {'m.title': 'Joe Versus the Volcano'},\n",
              " {'m.title': 'Jerry Maguire'},\n",
              " {'m.title': 'Hoffa'},\n",
              " {'m.title': 'Frost/Nixon'},\n",
              " {'m.title': 'Cloud Atlas'},\n",
              " {'m.title': \"Charlie Wilson's War\"},\n",
              " {'m.title': 'Cast Away'},\n",
              " {'m.title': 'Bicentennial Man'},\n",
              " {'m.title': 'As Good as It Gets'},\n",
              " {'m.title': 'Apollo 13'},\n",
              " {'m.title': 'A League of Their Own'},\n",
              " {'m.title': 'A Few Good Men'}]"
            ]
          },
          "metadata": {},
          "execution_count": 23
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "LTaZmu5MKzSO",
        "outputId": "a19f6d48-ee6f-4ba2-fb14-a175a885f1d4"
      },
      "source": [
        "# 5. il numero di film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN COUNT(m)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 14,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'COUNT(m)': 38}]"
            ]
          },
          "metadata": {},
          "execution_count": 14
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FggIlvdDKzeX",
        "outputId": "9deb6c35-3696-47e7-9bbf-55914dc2fbe7"
      },
      "source": [
        "# 6. i film presentati tra il 1995 e il 2000 (estremi inclusi)\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "WHERE m.released >= 1995 AND m.released <= 2000 \n",
        "RETURN m\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 15,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m': {'released': 1995,\n",
              "   'tagline': 'The hottest data on earth. In the coolest head in town',\n",
              "   'title': 'Johnny Mnemonic'}},\n",
              " {'m': {'released': 1995,\n",
              "   'tagline': 'Houston, we have a problem.',\n",
              "   'title': 'Apollo 13'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do',\n",
              "   'title': 'That Thing You Do'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': 'Come as you are',\n",
              "   'title': 'The Birdcage'}},\n",
              " {'m': {'released': 1996,\n",
              "   'tagline': \"Don't Breathe. Don't Look Back.\",\n",
              "   'title': 'Twister'}},\n",
              " {'m': {'released': 1997,\n",
              "   'tagline': 'Evil has its winning ways',\n",
              "   'title': \"The Devil's Advocate\"}},\n",
              " {'m': {'released': 1997,\n",
              "   'tagline': 'A comedy from the heart that goes for the throat.',\n",
              "   'title': 'As Good as It Gets'}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'After life there is more. The end is just the beginning.',\n",
              "   'title': 'What Dreams May Come'}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'At odds in life... in love on-line.',\n",
              "   'title': \"You've Got Mail\"}},\n",
              " {'m': {'released': 1998,\n",
              "   'tagline': 'Can two friends sleep together and still love each other in the morning?',\n",
              "   'title': 'When Harry Met Sally'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': 'Welcome to the Real World',\n",
              "   'title': 'The Matrix'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': 'First loves last. Forever.',\n",
              "   'title': 'Snow Falling on Cedars'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': \"Walk a mile you'll never forget.\",\n",
              "   'title': 'The Green Mile'}},\n",
              " {'m': {'released': 1999,\n",
              "   'tagline': \"One robot's 200 year journey to become an ordinary man.\",\n",
              "   'title': 'Bicentennial Man'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'The rest of his life begins now.',\n",
              "   'title': 'Jerry Maguire'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever',\n",
              "   'title': 'The Replacements'}},\n",
              " {'m': {'released': 2000,\n",
              "   'tagline': 'At the edge of the world, his journey begins.',\n",
              "   'title': 'Cast Away'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 15
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "VDJAuHI5KzrO",
        "outputId": "e643048e-6d69-4b32-eb80-e9dc9bcf6802"
      },
      "source": [
        "# 7. il numero di film presentanti in ogni anno. Chaimare il numero di film \"totale\". Ordinare sul numero di film in ordine decrescente\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.released, COUNT(m) AS totale \n",
        "ORDER BY totale DESC\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 16,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.released': 1999, 'totale': 4},\n",
              " {'m.released': 1992, 'totale': 4},\n",
              " {'m.released': 2003, 'totale': 3},\n",
              " {'m.released': 2000, 'totale': 3},\n",
              " {'m.released': 1998, 'totale': 3},\n",
              " {'m.released': 1996, 'totale': 3},\n",
              " {'m.released': 2006, 'totale': 3},\n",
              " {'m.released': 1997, 'totale': 2},\n",
              " {'m.released': 1986, 'totale': 2},\n",
              " {'m.released': 1995, 'totale': 2},\n",
              " {'m.released': 2008, 'totale': 2},\n",
              " {'m.released': 1993, 'totale': 1},\n",
              " {'m.released': 1990, 'totale': 1},\n",
              " {'m.released': 2012, 'totale': 1},\n",
              " {'m.released': 2009, 'totale': 1},\n",
              " {'m.released': 1975, 'totale': 1},\n",
              " {'m.released': 2007, 'totale': 1},\n",
              " {'m.released': 2004, 'totale': 1}]"
            ]
          },
          "metadata": {},
          "execution_count": 16
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "WFwoNSOKK0Af",
        "outputId": "9fd803b4-f58d-479c-eaae-b0a1edb51c31"
      },
      "source": [
        "# 8. tutte le persone coinvolte nel film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (p:Person)-[relatedTo]-(m:Movie {title: \"Top Gun\"}) \n",
        "RETURN p.name, type(relatedTo)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 26,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'p.name': 'Jim Cash', 'type(relatedTo)': 'WROTE'},\n",
              " {'p.name': 'Val Kilmer', 'type(relatedTo)': 'ACTED_IN'},\n",
              " {'p.name': 'Tony Scott', 'type(relatedTo)': 'DIRECTED'},\n",
              " {'p.name': 'Meg Ryan', 'type(relatedTo)': 'ACTED_IN'},\n",
              " {'p.name': 'Tom Skerritt', 'type(relatedTo)': 'ACTED_IN'},\n",
              " {'p.name': 'Kelly McGillis', 'type(relatedTo)': 'ACTED_IN'},\n",
              " {'p.name': 'Tom Cruise', 'type(relatedTo)': 'ACTED_IN'},\n",
              " {'p.name': 'Anthony Edwards', 'type(relatedTo)': 'ACTED_IN'}]"
            ]
          },
          "metadata": {},
          "execution_count": 26
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1WwuMckmK0LO",
        "outputId": "5e1eddec-8d24-49ea-8fec-f5e85a128550"
      },
      "source": [
        "# 9. gli attori del film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 18,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'p': {'born': 1959, 'name': 'Val Kilmer'}},\n",
              " {'p': {'born': 1961, 'name': 'Meg Ryan'}},\n",
              " {'p': {'born': 1933, 'name': 'Tom Skerritt'}},\n",
              " {'p': {'born': 1957, 'name': 'Kelly McGillis'}},\n",
              " {'p': {'born': 1962, 'name': 'Tom Cruise'}},\n",
              " {'p': {'born': 1962, 'name': 'Anthony Edwards'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 18
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "V_0G_MCgK0W-",
        "outputId": "38232abb-7dab-4e26-9116-c0bf87c04920"
      },
      "source": [
        "# 10. i nomi degli attori del film \"Top Gun\" ordinati in ordine alfabetico\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p.name \n",
        "ORDER BY p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'p.name': 'Anthony Edwards'},\n",
              " {'p.name': 'Kelly McGillis'},\n",
              " {'p.name': 'Meg Ryan'},\n",
              " {'p.name': 'Tom Cruise'},\n",
              " {'p.name': 'Tom Skerritt'},\n",
              " {'p.name': 'Val Kilmer'}]"
            ]
          },
          "metadata": {},
          "execution_count": 19
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "gQe3OWlqK0l_",
        "outputId": "55e5abdc-98bf-4f42-f4b2-d696b9bf047d"
      },
      "source": [
        "# 11. i nomi degli attori del film \"Top Gun\" ordinati in ordine alfabetico e il ruolo che hanno recitato nel film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p.name, type(a) \n",
        "ORDER BY p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'p.name': 'Anthony Edwards', 'type(a)': 'ACTED_IN'},\n",
              " {'p.name': 'Kelly McGillis', 'type(a)': 'ACTED_IN'},\n",
              " {'p.name': 'Meg Ryan', 'type(a)': 'ACTED_IN'},\n",
              " {'p.name': 'Tom Cruise', 'type(a)': 'ACTED_IN'},\n",
              " {'p.name': 'Tom Skerritt', 'type(a)': 'ACTED_IN'},\n",
              " {'p.name': 'Val Kilmer', 'type(a)': 'ACTED_IN'}]"
            ]
          },
          "metadata": {},
          "execution_count": 20
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "eebzvw6qK06H",
        "outputId": "3dce2ec0-068f-4395-ee3e-5dd28a5af947"
      },
      "source": [
        "# 12. il numero di attori del film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN COUNT(p)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 21,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'COUNT(p)': 6}]"
            ]
          },
          "metadata": {},
          "execution_count": 21
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "TyCqLpoiK1Tm",
        "outputId": "d4bada0d-d4b3-46be-c01a-d1dbc519ea29"
      },
      "source": [
        "# 13. il regista e l'autore di \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[:WROTE|:DIRECTED]-(p:Person) \n",
        "RETURN p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 25,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'p.name': 'Jim Cash'}, {'p.name': 'Tony Scott'}]"
            ]
          },
          "metadata": {},
          "execution_count": 25
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "KJs6rR58K1hG",
        "outputId": "86feaf48-0075-4c99-d84e-1abe03fddb44"
      },
      "source": [
        "# 14. l'elenco dei titoli dei film con i registi e gli attori che vi hanno preso parte\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie)<-[a:DIRECTED|ACTED_IN]-(p:Person) \n",
        "RETURN m.title, p.name, type(a)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 31,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.title': 'The Matrix', 'p.name': 'Emil Eifrem', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix', 'p.name': 'Lana Wachowski', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix', 'p.name': 'Lilly Wachowski', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix', 'p.name': 'Hugo Weaving', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix',\n",
              "  'p.name': 'Laurence Fishburne',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix',\n",
              "  'p.name': 'Carrie-Anne Moss',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix', 'p.name': 'Keanu Reeves', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Lana Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Lilly Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Hugo Weaving',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Laurence Fishburne',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Carrie-Anne Moss',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Reloaded',\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Lana Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Lilly Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Hugo Weaving',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Laurence Fishburne',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Carrie-Anne Moss',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Matrix Revolutions',\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"The Devil's Advocate\",\n",
              "  'p.name': 'Taylor Hackford',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"The Devil's Advocate\",\n",
              "  'p.name': 'Al Pacino',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"The Devil's Advocate\",\n",
              "  'p.name': 'Charlize Theron',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"The Devil's Advocate\",\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'James Marshall',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Kevin Pollak',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'J.T. Walsh', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Aaron Sorkin',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Cuba Gooding Jr.',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Christopher Guest',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Rob Reiner', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Noah Wyle', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Kiefer Sutherland',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Kevin Bacon', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Demi Moore', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men',\n",
              "  'p.name': 'Jack Nicholson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Tom Cruise', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Val Kilmer', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Tony Scott', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Meg Ryan', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Tom Skerritt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Kelly McGillis', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Tom Cruise', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Anthony Edwards', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': \"Jerry O'Connell\",\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire', 'p.name': 'Bonnie Hunt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': 'Cameron Crowe',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Jerry Maguire', 'p.name': 'Jay Mohr', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': 'Cuba Gooding Jr.',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': 'Jonathan Lipnicki',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': 'Renee Zellweger',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire',\n",
              "  'p.name': 'Kelly Preston',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire', 'p.name': 'Regina King', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Jerry Maguire', 'p.name': 'Tom Cruise', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me',\n",
              "  'p.name': \"Jerry O'Connell\",\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'Rob Reiner', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'River Phoenix', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'Marshall Bell', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'Wil Wheaton', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me',\n",
              "  'p.name': 'Kiefer Sutherland',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'John Cusack', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Stand By Me', 'p.name': 'Corey Feldman', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'As Good as It Gets',\n",
              "  'p.name': 'Helen Hunt',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'As Good as It Gets',\n",
              "  'p.name': 'Jack Nicholson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'As Good as It Gets',\n",
              "  'p.name': 'Cuba Gooding Jr.',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'As Good as It Gets',\n",
              "  'p.name': 'Greg Kinnear',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'As Good as It Gets',\n",
              "  'p.name': 'James L. Brooks',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Vincent Ward',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Robin Williams',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Cuba Gooding Jr.',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Max von Sydow',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Werner Herzog',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'What Dreams May Come',\n",
              "  'p.name': 'Annabella Sciorra',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Snow Falling on Cedars',\n",
              "  'p.name': 'Ethan Hawke',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Snow Falling on Cedars',\n",
              "  'p.name': 'Scott Hicks',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Snow Falling on Cedars',\n",
              "  'p.name': 'Rick Yune',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Snow Falling on Cedars',\n",
              "  'p.name': 'Max von Sydow',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Snow Falling on Cedars',\n",
              "  'p.name': 'James Cromwell',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\", 'p.name': 'Tom Hanks', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\",\n",
              "  'p.name': 'Nora Ephron',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"You've Got Mail\",\n",
              "  'p.name': 'Parker Posey',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\",\n",
              "  'p.name': 'Greg Kinnear',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\", 'p.name': 'Meg Ryan', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\", 'p.name': 'Steve Zahn', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"You've Got Mail\",\n",
              "  'p.name': 'Dave Chappelle',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Nora Ephron',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Meg Ryan',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Victor Garber',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Bill Pullman',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': 'Rita Wilson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Sleepless in Seattle',\n",
              "  'p.name': \"Rosie O'Donnell\",\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Joe Versus the Volcano',\n",
              "  'p.name': 'John Patrick Stanley',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Joe Versus the Volcano',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Joe Versus the Volcano',\n",
              "  'p.name': 'Nathan Lane',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Joe Versus the Volcano',\n",
              "  'p.name': 'Meg Ryan',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'When Harry Met Sally',\n",
              "  'p.name': 'Carrie Fisher',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'When Harry Met Sally',\n",
              "  'p.name': 'Billy Crystal',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'When Harry Met Sally',\n",
              "  'p.name': 'Bruno Kirby',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'When Harry Met Sally',\n",
              "  'p.name': 'Meg Ryan',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'When Harry Met Sally',\n",
              "  'p.name': 'Rob Reiner',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'That Thing You Do',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'That Thing You Do',\n",
              "  'p.name': 'Liv Tyler',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'That Thing You Do',\n",
              "  'p.name': 'Charlize Theron',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'That Thing You Do',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Replacements',\n",
              "  'p.name': 'Brooke Langton',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Replacements',\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Replacements',\n",
              "  'p.name': 'Howard Deutch',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Replacements',\n",
              "  'p.name': 'Orlando Jones',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Replacements',\n",
              "  'p.name': 'Gene Hackman',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'RescueDawn', 'p.name': 'Zach Grenier', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'RescueDawn', 'p.name': 'Steve Zahn', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'RescueDawn', 'p.name': 'Werner Herzog', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'RescueDawn', 'p.name': 'Christian Bale', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'RescueDawn', 'p.name': 'Marshall Bell', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Birdcage',\n",
              "  'p.name': 'Robin Williams',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Birdcage', 'p.name': 'Mike Nichols', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Birdcage', 'p.name': 'Nathan Lane', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Birdcage', 'p.name': 'Gene Hackman', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Unforgiven', 'p.name': 'Clint Eastwood', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Unforgiven', 'p.name': 'Gene Hackman', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Unforgiven', 'p.name': 'Clint Eastwood', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Unforgiven', 'p.name': 'Richard Harris', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Johnny Mnemonic', 'p.name': 'Ice-T', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Johnny Mnemonic', 'p.name': 'Dina Meyer', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Johnny Mnemonic',\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Johnny Mnemonic',\n",
              "  'p.name': 'Takeshi Kitano',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Johnny Mnemonic',\n",
              "  'p.name': 'Robert Longo',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Tom Hanks', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Jim Broadbent', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Tom Tykwer', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Lana Wachowski', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Halle Berry', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cloud Atlas', 'p.name': 'Hugo Weaving', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cloud Atlas',\n",
              "  'p.name': 'Lilly Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Da Vinci Code',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Da Vinci Code',\n",
              "  'p.name': 'Ron Howard',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Da Vinci Code',\n",
              "  'p.name': 'Ian McKellen',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Da Vinci Code',\n",
              "  'p.name': 'Audrey Tautou',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Da Vinci Code',\n",
              "  'p.name': 'Paul Bettany',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'V for Vendetta', 'p.name': 'John Hurt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'V for Vendetta', 'p.name': 'Stephen Rea', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'V for Vendetta',\n",
              "  'p.name': 'Natalie Portman',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'V for Vendetta',\n",
              "  'p.name': 'Hugo Weaving',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'V for Vendetta',\n",
              "  'p.name': 'James Marshall',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'V for Vendetta', 'p.name': 'Ben Miles', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Lana Wachowski', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Emile Hirsch', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer',\n",
              "  'p.name': 'Lilly Wachowski',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Rain', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer',\n",
              "  'p.name': 'Christina Ricci',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Ben Miles', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Susan Sarandon', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'John Goodman', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Speed Racer', 'p.name': 'Matthew Fox', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Ninja Assassin',\n",
              "  'p.name': 'James Marshall',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Ninja Assassin', 'p.name': 'Rain', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Ninja Assassin', 'p.name': 'Ben Miles', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Ninja Assassin', 'p.name': 'Rick Yune', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Ninja Assassin',\n",
              "  'p.name': 'Naomie Harris',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile',\n",
              "  'p.name': 'Sam Rockwell',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile', 'p.name': 'Bonnie Hunt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile',\n",
              "  'p.name': 'Patricia Clarkson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile',\n",
              "  'p.name': 'James Cromwell',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile',\n",
              "  'p.name': 'Frank Darabont',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'The Green Mile', 'p.name': 'Tom Hanks', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile',\n",
              "  'p.name': 'Michael Clarke Duncan',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile', 'p.name': 'David Morse', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Green Mile', 'p.name': 'Gary Sinise', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Sam Rockwell', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Michael Sheen', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Ron Howard', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Frank Langella', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Oliver Platt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Frost/Nixon', 'p.name': 'Kevin Bacon', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Hoffa', 'p.name': 'John C. Reilly', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Hoffa', 'p.name': 'Danny DeVito', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Hoffa', 'p.name': 'Danny DeVito', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Hoffa', 'p.name': 'J.T. Walsh', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Hoffa', 'p.name': 'Jack Nicholson', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Tom Hanks', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Ron Howard', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Ed Harris', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Gary Sinise', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Kevin Bacon', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Apollo 13', 'p.name': 'Bill Paxton', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Twister', 'p.name': 'Jan de Bont', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'Twister', 'p.name': 'Helen Hunt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Twister', 'p.name': 'Bill Paxton', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Twister',\n",
              "  'p.name': 'Philip Seymour Hoffman',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Twister', 'p.name': 'Zach Grenier', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cast Away', 'p.name': 'Helen Hunt', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cast Away', 'p.name': 'Tom Hanks', 'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Cast Away', 'p.name': 'Robert Zemeckis', 'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\",\n",
              "  'p.name': 'Danny DeVito',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\",\n",
              "  'p.name': 'Jack Nicholson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"One Flew Over the Cuckoo's Nest\",\n",
              "  'p.name': 'Milos Forman',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"Something's Gotta Give\",\n",
              "  'p.name': 'Keanu Reeves',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"Something's Gotta Give\",\n",
              "  'p.name': 'Nancy Meyers',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"Something's Gotta Give\",\n",
              "  'p.name': 'Diane Keaton',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"Something's Gotta Give\",\n",
              "  'p.name': 'Jack Nicholson',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Bicentennial Man',\n",
              "  'p.name': 'Robin Williams',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Bicentennial Man',\n",
              "  'p.name': 'Oliver Platt',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'Bicentennial Man',\n",
              "  'p.name': 'Chris Columbus',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"Charlie Wilson's War\",\n",
              "  'p.name': 'Julia Roberts',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"Charlie Wilson's War\",\n",
              "  'p.name': 'Mike Nichols',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': \"Charlie Wilson's War\",\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': \"Charlie Wilson's War\",\n",
              "  'p.name': 'Philip Seymour Hoffman',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Polar Express',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'The Polar Express',\n",
              "  'p.name': 'Robert Zemeckis',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Tom Hanks',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Madonna',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Penny Marshall',\n",
              "  'type(a)': 'DIRECTED'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': \"Rosie O'Donnell\",\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Geena Davis',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Bill Paxton',\n",
              "  'type(a)': 'ACTED_IN'},\n",
              " {'m.title': 'A League of Their Own',\n",
              "  'p.name': 'Lori Petty',\n",
              "  'type(a)': 'ACTED_IN'}]"
            ]
          },
          "metadata": {},
          "execution_count": 31
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "dkcIFtE-K1s_",
        "outputId": "53436bd8-e93c-4f3b-b3a9-52df50a296d4"
      },
      "source": [
        "# 15. i film in cui ha recitato Tom Cruise e i rispettivi registi\n",
        "cypher_query = '''\n",
        "MATCH (tom:Person {name: \"Tom Cruise\"})-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(p:Person) \n",
        "RETURN m.title, p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "result"
      ],
      "execution_count": 30,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'m.title': 'Jerry Maguire', 'p.name': 'Cameron Crowe'},\n",
              " {'m.title': 'Top Gun', 'p.name': 'Tony Scott'},\n",
              " {'m.title': 'A Few Good Men', 'p.name': 'Rob Reiner'}]"
            ]
          },
          "metadata": {},
          "execution_count": 30
        }
      ]
    }
  ]
}