{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Esercizi Neo4j.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "b1vt5jhzZa8I"
      },
      "source": [
        "**Esercizi Neo4j**"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "r9sFh0jGIM93",
        "outputId": "5cb25d59-cd6d-4559-a381-09841d374182"
      },
      "source": [
        "!pip install neo4j-driver"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting neo4j-driver\n",
            "  Downloading neo4j-driver-4.4.0.tar.gz (89 kB)\n",
            "\u001b[?25l\r\u001b[K     |███▊                            | 10 kB 14.3 MB/s eta 0:00:01\r\u001b[K     |███████▍                        | 20 kB 16.2 MB/s eta 0:00:01\r\u001b[K     |███████████                     | 30 kB 21.1 MB/s eta 0:00:01\r\u001b[K     |██████████████▊                 | 40 kB 25.2 MB/s eta 0:00:01\r\u001b[K     |██████████████████▍             | 51 kB 27.8 MB/s eta 0:00:01\r\u001b[K     |██████████████████████          | 61 kB 30.8 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▊      | 71 kB 25.0 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▍  | 81 kB 26.3 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 89 kB 3.8 MB/s \n",
            "\u001b[?25hRequirement already satisfied: pytz in /usr/local/lib/python3.7/dist-packages (from neo4j-driver) (2018.9)\n",
            "Building wheels for collected packages: neo4j-driver\n",
            "  Building wheel for neo4j-driver (setup.py) ... \u001b[?25l\u001b[?25hdone\n",
            "  Created wheel for neo4j-driver: filename=neo4j_driver-4.4.0-py3-none-any.whl size=114976 sha256=f19bd6b9c1878663453f50cd70bea3b82158e73dde709a6990487f14bdb1a8ee\n",
            "  Stored in directory: /root/.cache/pip/wheels/5e/89/23/48d22f30bfad0866aac1078fb2e24db1dd3750c46198557ffe\n",
            "Successfully built neo4j-driver\n",
            "Installing collected packages: neo4j-driver\n",
            "Successfully installed neo4j-driver-4.4.0\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "yZD-pSnLIjfQ"
      },
      "source": [
        "from neo4j import GraphDatabase, basic_auth\n",
        "import pandas as pd\n",
        "pd.options.display.max_rows = 999"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "FVuqG8vlIj7v"
      },
      "source": [
        "driver = GraphDatabase.driver(\"bolt://52.87.238.189:7687\", auth=basic_auth(\"neo4j\", \"pleasure-thunder-casualties\"))"
      ],
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "9WDwDfr0JY9o"
      },
      "source": [
        "Prendere in considerazione il database Movies e scrivere in un file word le istruzioni Cypher per estrarre le seguenti informazioni:"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 293
        },
        "id": "esPrYtnKJK7m",
        "outputId": "41112fb7-361a-4ae4-9dcd-9c1d00247c73"
      },
      "source": [
        "# 0. tutto il database\n",
        "cypher_query = '''\n",
        "MATCH (a)-[r]-(b) \n",
        "RETURN a, r, b\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df.head()"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>a</th>\n",
              "      <th>r</th>\n",
              "      <th>b</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "      <td>({'name': 'Emil Eifrem', 'born': 1978}, ACTED_...</td>\n",
              "      <td>{'name': 'Emil Eifrem', 'born': 1978}</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "      <td>({'name': 'Joel Silver', 'born': 1952}, PRODUC...</td>\n",
              "      <td>{'name': 'Joel Silver', 'born': 1952}</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "      <td>({'name': 'Lana Wachowski', 'born': 1965}, DIR...</td>\n",
              "      <td>{'name': 'Lana Wachowski', 'born': 1965}</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "      <td>({'name': 'Lilly Wachowski', 'born': 1967}, DI...</td>\n",
              "      <td>{'name': 'Lilly Wachowski', 'born': 1967}</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "      <td>({'name': 'Hugo Weaving', 'born': 1960}, ACTED...</td>\n",
              "      <td>{'name': 'Hugo Weaving', 'born': 1960}</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                                                   a  ...                                          b\n",
              "0  {'tagline': 'Welcome to the Real World', 'titl...  ...      {'name': 'Emil Eifrem', 'born': 1978}\n",
              "1  {'tagline': 'Welcome to the Real World', 'titl...  ...      {'name': 'Joel Silver', 'born': 1952}\n",
              "2  {'tagline': 'Welcome to the Real World', 'titl...  ...   {'name': 'Lana Wachowski', 'born': 1965}\n",
              "3  {'tagline': 'Welcome to the Real World', 'titl...  ...  {'name': 'Lilly Wachowski', 'born': 1967}\n",
              "4  {'tagline': 'Welcome to the Real World', 'titl...  ...     {'name': 'Hugo Weaving', 'born': 1960}\n",
              "\n",
              "[5 rows x 3 columns]"
            ]
          },
          "metadata": {},
          "execution_count": 17
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "svFX22LjJj6I",
        "outputId": "d61840e4-b1b2-4fcf-fa29-72b94e6a032a"
      },
      "source": [
        "# 1. i film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df.head()"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>{'tagline': 'Free your mind', 'title': 'The Ma...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>{'tagline': 'Everything that has a beginning h...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>{'tagline': 'Evil has its winning ways', 'titl...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>{'tagline': 'In the heart of the nation's capi...</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                                                   m\n",
              "0  {'tagline': 'Welcome to the Real World', 'titl...\n",
              "1  {'tagline': 'Free your mind', 'title': 'The Ma...\n",
              "2  {'tagline': 'Everything that has a beginning h...\n",
              "3  {'tagline': 'Evil has its winning ways', 'titl...\n",
              "4  {'tagline': 'In the heart of the nation's capi..."
            ]
          },
          "metadata": {},
          "execution_count": 18
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 206
        },
        "id": "FyKG7sCZKyrf",
        "outputId": "32a34348-a3d2-4503-affa-aa36002d6311"
      },
      "source": [
        "# 2. i titoli dei film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df.head()"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.title</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>The Matrix</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>A Few Good Men</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                  m.title\n",
              "0              The Matrix\n",
              "1     The Matrix Reloaded\n",
              "2  The Matrix Revolutions\n",
              "3    The Devil's Advocate\n",
              "4          A Few Good Men"
            ]
          },
          "metadata": {},
          "execution_count": 22
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "kdL3KCfLKy03",
        "outputId": "2eeae217-4a1e-4d64-ce77-5a9065233323"
      },
      "source": [
        "# 3. i titoli dei film in ordine alfabetico\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title \n",
        "ORDER BY m.title\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.title</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>A Few Good Men</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>A League of Their Own</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Apollo 13</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Bicentennial Man</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Cast Away</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>Hoffa</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>One Flew Over the Cuckoo's Nest</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>RescueDawn</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>18</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>19</th>\n",
              "      <td>Speed Racer</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>20</th>\n",
              "      <td>Stand By Me</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>21</th>\n",
              "      <td>That Thing You Do</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>22</th>\n",
              "      <td>The Birdcage</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>23</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>24</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>25</th>\n",
              "      <td>The Green Mile</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>26</th>\n",
              "      <td>The Matrix</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>27</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>28</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>29</th>\n",
              "      <td>The Polar Express</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>30</th>\n",
              "      <td>The Replacements</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>31</th>\n",
              "      <td>Top Gun</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>32</th>\n",
              "      <td>Twister</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>33</th>\n",
              "      <td>Unforgiven</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>34</th>\n",
              "      <td>V for Vendetta</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>35</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>36</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>37</th>\n",
              "      <td>You've Got Mail</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                            m.title\n",
              "0                    A Few Good Men\n",
              "1             A League of Their Own\n",
              "2                         Apollo 13\n",
              "3                As Good as It Gets\n",
              "4                  Bicentennial Man\n",
              "5                         Cast Away\n",
              "6              Charlie Wilson's War\n",
              "7                       Cloud Atlas\n",
              "8                       Frost/Nixon\n",
              "9                             Hoffa\n",
              "10                    Jerry Maguire\n",
              "11           Joe Versus the Volcano\n",
              "12                  Johnny Mnemonic\n",
              "13                   Ninja Assassin\n",
              "14  One Flew Over the Cuckoo's Nest\n",
              "15                       RescueDawn\n",
              "16             Sleepless in Seattle\n",
              "17           Snow Falling on Cedars\n",
              "18           Something's Gotta Give\n",
              "19                      Speed Racer\n",
              "20                      Stand By Me\n",
              "21                That Thing You Do\n",
              "22                     The Birdcage\n",
              "23                The Da Vinci Code\n",
              "24             The Devil's Advocate\n",
              "25                   The Green Mile\n",
              "26                       The Matrix\n",
              "27              The Matrix Reloaded\n",
              "28           The Matrix Revolutions\n",
              "29                The Polar Express\n",
              "30                 The Replacements\n",
              "31                          Top Gun\n",
              "32                          Twister\n",
              "33                       Unforgiven\n",
              "34                   V for Vendetta\n",
              "35             What Dreams May Come\n",
              "36             When Harry Met Sally\n",
              "37                  You've Got Mail"
            ]
          },
          "metadata": {},
          "execution_count": 24
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "uwzHkyl-KzB3",
        "outputId": "109de6a8-e8ac-4b71-e249-c94548580176"
      },
      "source": [
        "# 4. i titoli dei film dalla Z alla A\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.title \n",
        "ORDER BY m.title DESC\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.title</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>You've Got Mail</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>V for Vendetta</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Unforgiven</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Twister</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>Top Gun</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>The Replacements</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>The Polar Express</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>The Matrix</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>The Green Mile</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>The Birdcage</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>That Thing You Do</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>Stand By Me</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>18</th>\n",
              "      <td>Speed Racer</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>19</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>20</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>21</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>22</th>\n",
              "      <td>RescueDawn</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>23</th>\n",
              "      <td>One Flew Over the Cuckoo's Nest</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>24</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>25</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>26</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>27</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>28</th>\n",
              "      <td>Hoffa</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>29</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>30</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>31</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>32</th>\n",
              "      <td>Cast Away</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>33</th>\n",
              "      <td>Bicentennial Man</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>34</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>35</th>\n",
              "      <td>Apollo 13</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>36</th>\n",
              "      <td>A League of Their Own</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>37</th>\n",
              "      <td>A Few Good Men</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                            m.title\n",
              "0                   You've Got Mail\n",
              "1              When Harry Met Sally\n",
              "2              What Dreams May Come\n",
              "3                    V for Vendetta\n",
              "4                        Unforgiven\n",
              "5                           Twister\n",
              "6                           Top Gun\n",
              "7                  The Replacements\n",
              "8                 The Polar Express\n",
              "9            The Matrix Revolutions\n",
              "10              The Matrix Reloaded\n",
              "11                       The Matrix\n",
              "12                   The Green Mile\n",
              "13             The Devil's Advocate\n",
              "14                The Da Vinci Code\n",
              "15                     The Birdcage\n",
              "16                That Thing You Do\n",
              "17                      Stand By Me\n",
              "18                      Speed Racer\n",
              "19           Something's Gotta Give\n",
              "20           Snow Falling on Cedars\n",
              "21             Sleepless in Seattle\n",
              "22                       RescueDawn\n",
              "23  One Flew Over the Cuckoo's Nest\n",
              "24                   Ninja Assassin\n",
              "25                  Johnny Mnemonic\n",
              "26           Joe Versus the Volcano\n",
              "27                    Jerry Maguire\n",
              "28                            Hoffa\n",
              "29                      Frost/Nixon\n",
              "30                      Cloud Atlas\n",
              "31             Charlie Wilson's War\n",
              "32                        Cast Away\n",
              "33                 Bicentennial Man\n",
              "34               As Good as It Gets\n",
              "35                        Apollo 13\n",
              "36            A League of Their Own\n",
              "37                   A Few Good Men"
            ]
          },
          "metadata": {},
          "execution_count": 25
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 80
        },
        "id": "LTaZmu5MKzSO",
        "outputId": "a84540c4-213f-44f4-dd70-c92d92e88b66"
      },
      "source": [
        "# 5. il numero di film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN COUNT(m)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>COUNT(m)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>38</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "   COUNT(m)\n",
              "0        38"
            ]
          },
          "metadata": {},
          "execution_count": 26
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 582
        },
        "id": "FggIlvdDKzeX",
        "outputId": "fc7638cd-7885-44ba-b036-1b4532c57352"
      },
      "source": [
        "# 6. i film presentati tra il 1995 e il 2000 (estremi inclusi)\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "WHERE m.released >= 1995 AND m.released <= 2000 \n",
        "RETURN m\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>{'tagline': 'The hottest data on earth. In the...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>{'tagline': 'Houston, we have a problem.', 'ti...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>{'tagline': 'In every life there comes a time ...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>{'tagline': 'Come as you are', 'title': 'The B...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>{'tagline': 'Don't Breathe. Don't Look Back.',...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>{'tagline': 'Evil has its winning ways', 'titl...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>{'tagline': 'A comedy from the heart that goes...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>{'tagline': 'After life there is more. The end...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>{'tagline': 'At odds in life... in love on-lin...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>{'tagline': 'Can two friends sleep together an...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>{'tagline': 'Welcome to the Real World', 'titl...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>{'tagline': 'First loves last. Forever.', 'tit...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>{'tagline': 'Walk a mile you'll never forget.'...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>{'tagline': 'One robot's 200 year journey to b...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>{'tagline': 'The rest of his life begins now.'...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>{'tagline': 'Pain heals, Chicks dig scars... G...</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>{'tagline': 'At the edge of the world, his jou...</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                                                    m\n",
              "0   {'tagline': 'The hottest data on earth. In the...\n",
              "1   {'tagline': 'Houston, we have a problem.', 'ti...\n",
              "2   {'tagline': 'In every life there comes a time ...\n",
              "3   {'tagline': 'Come as you are', 'title': 'The B...\n",
              "4   {'tagline': 'Don't Breathe. Don't Look Back.',...\n",
              "5   {'tagline': 'Evil has its winning ways', 'titl...\n",
              "6   {'tagline': 'A comedy from the heart that goes...\n",
              "7   {'tagline': 'After life there is more. The end...\n",
              "8   {'tagline': 'At odds in life... in love on-lin...\n",
              "9   {'tagline': 'Can two friends sleep together an...\n",
              "10  {'tagline': 'Welcome to the Real World', 'titl...\n",
              "11  {'tagline': 'First loves last. Forever.', 'tit...\n",
              "12  {'tagline': 'Walk a mile you'll never forget.'...\n",
              "13  {'tagline': 'One robot's 200 year journey to b...\n",
              "14  {'tagline': 'The rest of his life begins now.'...\n",
              "15  {'tagline': 'Pain heals, Chicks dig scars... G...\n",
              "16  {'tagline': 'At the edge of the world, his jou..."
            ]
          },
          "metadata": {},
          "execution_count": 27
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 614
        },
        "id": "VDJAuHI5KzrO",
        "outputId": "7feeb772-08ac-4757-8ae0-d98acd553308"
      },
      "source": [
        "# 7. il numero di film presentanti in ogni anno. Chiamare il numero di film \"totale\". Ordinare sul numero di film in ordine decrescente\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie) \n",
        "RETURN m.released, COUNT(m) AS totale \n",
        "ORDER BY totale DESC\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.released</th>\n",
              "      <th>totale</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>1999</td>\n",
              "      <td>4</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>1992</td>\n",
              "      <td>4</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>2003</td>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>2000</td>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>1998</td>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>1996</td>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>2006</td>\n",
              "      <td>3</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>1997</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>1986</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>1995</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>2008</td>\n",
              "      <td>2</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>1993</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>1990</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>2012</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>2009</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>1975</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>2007</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>2004</td>\n",
              "      <td>1</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "    m.released  totale\n",
              "0         1999       4\n",
              "1         1992       4\n",
              "2         2003       3\n",
              "3         2000       3\n",
              "4         1998       3\n",
              "5         1996       3\n",
              "6         2006       3\n",
              "7         1997       2\n",
              "8         1986       2\n",
              "9         1995       2\n",
              "10        2008       2\n",
              "11        1993       1\n",
              "12        1990       1\n",
              "13        2012       1\n",
              "14        2009       1\n",
              "15        1975       1\n",
              "16        2007       1\n",
              "17        2004       1"
            ]
          },
          "metadata": {},
          "execution_count": 28
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 300
        },
        "id": "WFwoNSOKK0Af",
        "outputId": "7c19c191-2d8b-4c0a-b37b-3634716b19f9"
      },
      "source": [
        "# 8. tutte le persone coinvolte nel film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (p:Person)-[r]-(m:Movie {title: \"Top Gun\"}) \n",
        "RETURN p.name, type(r)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>p.name</th>\n",
              "      <th>type(r)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Jim Cash</td>\n",
              "      <td>WROTE</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Val Kilmer</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Tony Scott</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Tom Skerritt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Kelly McGillis</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>Tom Cruise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>Anthony Edwards</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "            p.name   type(r)\n",
              "0         Jim Cash     WROTE\n",
              "1       Val Kilmer  ACTED_IN\n",
              "2       Tony Scott  DIRECTED\n",
              "3         Meg Ryan  ACTED_IN\n",
              "4     Tom Skerritt  ACTED_IN\n",
              "5   Kelly McGillis  ACTED_IN\n",
              "6       Tom Cruise  ACTED_IN\n",
              "7  Anthony Edwards  ACTED_IN"
            ]
          },
          "metadata": {},
          "execution_count": 33
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 237
        },
        "id": "1WwuMckmK0LO",
        "outputId": "0d656d70-052e-4989-d86a-b3e101470dba"
      },
      "source": [
        "# 9. gli attori del film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>p.name</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Val Kilmer</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Meg Ryan</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Tom Skerritt</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Kelly McGillis</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Tom Cruise</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Anthony Edwards</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "            p.name\n",
              "0       Val Kilmer\n",
              "1         Meg Ryan\n",
              "2     Tom Skerritt\n",
              "3   Kelly McGillis\n",
              "4       Tom Cruise\n",
              "5  Anthony Edwards"
            ]
          },
          "metadata": {},
          "execution_count": 45
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 237
        },
        "id": "V_0G_MCgK0W-",
        "outputId": "78e1d52f-e709-4e69-81b7-0b3cf3aa2299"
      },
      "source": [
        "# 10. i nomi degli attori del film \"Top Gun\" ordinati in ordine alfabetico\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p.name \n",
        "ORDER BY p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>p.name</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Anthony Edwards</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Kelly McGillis</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Meg Ryan</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Tom Cruise</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Tom Skerritt</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Val Kilmer</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "            p.name\n",
              "0  Anthony Edwards\n",
              "1   Kelly McGillis\n",
              "2         Meg Ryan\n",
              "3       Tom Cruise\n",
              "4     Tom Skerritt\n",
              "5       Val Kilmer"
            ]
          },
          "metadata": {},
          "execution_count": 46
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 237
        },
        "id": "gQe3OWlqK0l_",
        "outputId": "03334569-354d-4e48-ecb9-5b633a9c754e"
      },
      "source": [
        "# 11. i nomi degli attori del film \"Top Gun\" ordinati in ordine alfabetico e il ruolo che hanno recitato nel film\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN p.name, a.roles\n",
        "ORDER BY p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>p.name</th>\n",
              "      <th>a.roles</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Anthony Edwards</td>\n",
              "      <td>[Goose]</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Kelly McGillis</td>\n",
              "      <td>[Charlie]</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>[Carole]</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>Tom Cruise</td>\n",
              "      <td>[Maverick]</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>Tom Skerritt</td>\n",
              "      <td>[Viper]</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>Val Kilmer</td>\n",
              "      <td>[Iceman]</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "            p.name     a.roles\n",
              "0  Anthony Edwards     [Goose]\n",
              "1   Kelly McGillis   [Charlie]\n",
              "2         Meg Ryan    [Carole]\n",
              "3       Tom Cruise  [Maverick]\n",
              "4     Tom Skerritt     [Viper]\n",
              "5       Val Kilmer    [Iceman]"
            ]
          },
          "metadata": {},
          "execution_count": 49
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 80
        },
        "id": "eebzvw6qK06H",
        "outputId": "2e23cd2f-41e0-4025-d9c4-2e5eb5880fda"
      },
      "source": [
        "# 12. il numero di attori del film \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:ACTED_IN]-(p:Person) \n",
        "RETURN COUNT(p)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>COUNT(p)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>6</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "   COUNT(p)\n",
              "0         6"
            ]
          },
          "metadata": {},
          "execution_count": 50
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 112
        },
        "id": "TyCqLpoiK1Tm",
        "outputId": "c9125385-d2c1-4540-904a-dc3da8b0de1f"
      },
      "source": [
        "# 13. il regista e l'autore di \"Top Gun\"\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie {title: 'Top Gun'})<-[a:WROTE|DIRECTED]-(p:Person) \n",
        "RETURN p.name, type(a)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>p.name</th>\n",
              "      <th>type(a)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Jim Cash</td>\n",
              "      <td>WROTE</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Tony Scott</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "       p.name   type(a)\n",
              "0    Jim Cash     WROTE\n",
              "1  Tony Scott  DIRECTED"
            ]
          },
          "metadata": {},
          "execution_count": 53
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "id": "KJs6rR58K1hG",
        "outputId": "e2d593c8-1718-40d0-8051-b20f63d42853"
      },
      "source": [
        "# 14. l'elenco dei titoli dei film con i registi e gli attori che vi hanno preso parte\n",
        "cypher_query = '''\n",
        "MATCH (m:Movie)<-[a:DIRECTED|ACTED_IN]-(p:Person) \n",
        "RETURN m.title, p.name, type(a)\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.title</th>\n",
              "      <th>p.name</th>\n",
              "      <th>type(a)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Emil Eifrem</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Lana Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Lilly Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Hugo Weaving</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Laurence Fishburne</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Carrie-Anne Moss</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>The Matrix</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Lana Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Lilly Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Hugo Weaving</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Laurence Fishburne</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Carrie-Anne Moss</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>The Matrix Reloaded</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Lana Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Lilly Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>15</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Hugo Weaving</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>16</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Laurence Fishburne</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>17</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Carrie-Anne Moss</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>18</th>\n",
              "      <td>The Matrix Revolutions</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>19</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "      <td>Taylor Hackford</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>20</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "      <td>Al Pacino</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>21</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "      <td>Charlize Theron</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>22</th>\n",
              "      <td>The Devil's Advocate</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>23</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>James Marshall</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>24</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Kevin Pollak</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>25</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>J.T. Walsh</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>26</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Aaron Sorkin</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>27</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Cuba Gooding Jr.</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>28</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Christopher Guest</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>29</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Rob Reiner</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>30</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Noah Wyle</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>31</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Kiefer Sutherland</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>32</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Kevin Bacon</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>33</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Demi Moore</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>34</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Jack Nicholson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>35</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Tom Cruise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>36</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Val Kilmer</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>37</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Tony Scott</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>38</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>39</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Tom Skerritt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>40</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Kelly McGillis</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>41</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Tom Cruise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>42</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Anthony Edwards</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>43</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Jerry O'Connell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>44</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Bonnie Hunt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>45</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Cameron Crowe</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>46</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Jay Mohr</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>47</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Cuba Gooding Jr.</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>48</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Jonathan Lipnicki</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>49</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Renee Zellweger</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>50</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Kelly Preston</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>51</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Regina King</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>52</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Tom Cruise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>53</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Jerry O'Connell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>54</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Rob Reiner</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>55</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>River Phoenix</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>56</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Marshall Bell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>57</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Wil Wheaton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>58</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Kiefer Sutherland</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>59</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>John Cusack</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>60</th>\n",
              "      <td>Stand By Me</td>\n",
              "      <td>Corey Feldman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>61</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "      <td>Helen Hunt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>62</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "      <td>Jack Nicholson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>63</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "      <td>Cuba Gooding Jr.</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>64</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "      <td>Greg Kinnear</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>65</th>\n",
              "      <td>As Good as It Gets</td>\n",
              "      <td>James L. Brooks</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>66</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Vincent Ward</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>67</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Robin Williams</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>68</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Cuba Gooding Jr.</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>69</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Max von Sydow</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>70</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Werner Herzog</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>71</th>\n",
              "      <td>What Dreams May Come</td>\n",
              "      <td>Annabella Sciorra</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>72</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "      <td>Ethan Hawke</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>73</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "      <td>Scott Hicks</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>74</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "      <td>Rick Yune</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>75</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "      <td>Max von Sydow</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>76</th>\n",
              "      <td>Snow Falling on Cedars</td>\n",
              "      <td>James Cromwell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>77</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>78</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Nora Ephron</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>79</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Parker Posey</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>80</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Greg Kinnear</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>81</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>82</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Steve Zahn</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>83</th>\n",
              "      <td>You've Got Mail</td>\n",
              "      <td>Dave Chappelle</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>84</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Nora Ephron</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>85</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>86</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Victor Garber</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>87</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>88</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Bill Pullman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>89</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Rita Wilson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>90</th>\n",
              "      <td>Sleepless in Seattle</td>\n",
              "      <td>Rosie O'Donnell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>91</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "      <td>John Patrick Stanley</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>92</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>93</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "      <td>Nathan Lane</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>94</th>\n",
              "      <td>Joe Versus the Volcano</td>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>95</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "      <td>Carrie Fisher</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>96</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "      <td>Billy Crystal</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>97</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "      <td>Bruno Kirby</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>98</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "      <td>Meg Ryan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>99</th>\n",
              "      <td>When Harry Met Sally</td>\n",
              "      <td>Rob Reiner</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>100</th>\n",
              "      <td>That Thing You Do</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>101</th>\n",
              "      <td>That Thing You Do</td>\n",
              "      <td>Liv Tyler</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>102</th>\n",
              "      <td>That Thing You Do</td>\n",
              "      <td>Charlize Theron</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>103</th>\n",
              "      <td>That Thing You Do</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>104</th>\n",
              "      <td>The Replacements</td>\n",
              "      <td>Brooke Langton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>105</th>\n",
              "      <td>The Replacements</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>106</th>\n",
              "      <td>The Replacements</td>\n",
              "      <td>Howard Deutch</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>107</th>\n",
              "      <td>The Replacements</td>\n",
              "      <td>Orlando Jones</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>108</th>\n",
              "      <td>The Replacements</td>\n",
              "      <td>Gene Hackman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>109</th>\n",
              "      <td>RescueDawn</td>\n",
              "      <td>Zach Grenier</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>110</th>\n",
              "      <td>RescueDawn</td>\n",
              "      <td>Steve Zahn</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>111</th>\n",
              "      <td>RescueDawn</td>\n",
              "      <td>Werner Herzog</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>112</th>\n",
              "      <td>RescueDawn</td>\n",
              "      <td>Christian Bale</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>113</th>\n",
              "      <td>RescueDawn</td>\n",
              "      <td>Marshall Bell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>114</th>\n",
              "      <td>The Birdcage</td>\n",
              "      <td>Robin Williams</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>115</th>\n",
              "      <td>The Birdcage</td>\n",
              "      <td>Mike Nichols</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>116</th>\n",
              "      <td>The Birdcage</td>\n",
              "      <td>Nathan Lane</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>117</th>\n",
              "      <td>The Birdcage</td>\n",
              "      <td>Gene Hackman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>118</th>\n",
              "      <td>Unforgiven</td>\n",
              "      <td>Clint Eastwood</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>119</th>\n",
              "      <td>Unforgiven</td>\n",
              "      <td>Gene Hackman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>120</th>\n",
              "      <td>Unforgiven</td>\n",
              "      <td>Clint Eastwood</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>121</th>\n",
              "      <td>Unforgiven</td>\n",
              "      <td>Richard Harris</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>122</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "      <td>Ice-T</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>123</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "      <td>Dina Meyer</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>124</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>125</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "      <td>Takeshi Kitano</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>126</th>\n",
              "      <td>Johnny Mnemonic</td>\n",
              "      <td>Robert Longo</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>127</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>128</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Jim Broadbent</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>129</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Tom Tykwer</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>130</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Lana Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>131</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Halle Berry</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>132</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Hugo Weaving</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>133</th>\n",
              "      <td>Cloud Atlas</td>\n",
              "      <td>Lilly Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>134</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>135</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "      <td>Ron Howard</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>136</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "      <td>Ian McKellen</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>137</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "      <td>Audrey Tautou</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>138</th>\n",
              "      <td>The Da Vinci Code</td>\n",
              "      <td>Paul Bettany</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>139</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>John Hurt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>140</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>Stephen Rea</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>141</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>Natalie Portman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>142</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>Hugo Weaving</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>143</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>James Marshall</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>144</th>\n",
              "      <td>V for Vendetta</td>\n",
              "      <td>Ben Miles</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>145</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Lana Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>146</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Emile Hirsch</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>147</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Lilly Wachowski</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>148</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Rain</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>149</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Christina Ricci</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>150</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Ben Miles</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>151</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Susan Sarandon</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>152</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>John Goodman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>153</th>\n",
              "      <td>Speed Racer</td>\n",
              "      <td>Matthew Fox</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>154</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "      <td>James Marshall</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>155</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "      <td>Rain</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>156</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "      <td>Ben Miles</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>157</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "      <td>Rick Yune</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>158</th>\n",
              "      <td>Ninja Assassin</td>\n",
              "      <td>Naomie Harris</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>159</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Sam Rockwell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>160</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Bonnie Hunt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>161</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Patricia Clarkson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>162</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>James Cromwell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>163</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Frank Darabont</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>164</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>165</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Michael Clarke Duncan</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>166</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>David Morse</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>167</th>\n",
              "      <td>The Green Mile</td>\n",
              "      <td>Gary Sinise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>168</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Sam Rockwell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>169</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Michael Sheen</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>170</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Ron Howard</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>171</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Frank Langella</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>172</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Oliver Platt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>173</th>\n",
              "      <td>Frost/Nixon</td>\n",
              "      <td>Kevin Bacon</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>174</th>\n",
              "      <td>Hoffa</td>\n",
              "      <td>John C. Reilly</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>175</th>\n",
              "      <td>Hoffa</td>\n",
              "      <td>Danny DeVito</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>176</th>\n",
              "      <td>Hoffa</td>\n",
              "      <td>Danny DeVito</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>177</th>\n",
              "      <td>Hoffa</td>\n",
              "      <td>J.T. Walsh</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>178</th>\n",
              "      <td>Hoffa</td>\n",
              "      <td>Jack Nicholson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>179</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>180</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Ron Howard</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>181</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Ed Harris</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>182</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Gary Sinise</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>183</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Kevin Bacon</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>184</th>\n",
              "      <td>Apollo 13</td>\n",
              "      <td>Bill Paxton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>185</th>\n",
              "      <td>Twister</td>\n",
              "      <td>Jan de Bont</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>186</th>\n",
              "      <td>Twister</td>\n",
              "      <td>Helen Hunt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>187</th>\n",
              "      <td>Twister</td>\n",
              "      <td>Bill Paxton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>188</th>\n",
              "      <td>Twister</td>\n",
              "      <td>Philip Seymour Hoffman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>189</th>\n",
              "      <td>Twister</td>\n",
              "      <td>Zach Grenier</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>190</th>\n",
              "      <td>Cast Away</td>\n",
              "      <td>Helen Hunt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>191</th>\n",
              "      <td>Cast Away</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>192</th>\n",
              "      <td>Cast Away</td>\n",
              "      <td>Robert Zemeckis</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>193</th>\n",
              "      <td>One Flew Over the Cuckoo's Nest</td>\n",
              "      <td>Danny DeVito</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>194</th>\n",
              "      <td>One Flew Over the Cuckoo's Nest</td>\n",
              "      <td>Jack Nicholson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>195</th>\n",
              "      <td>One Flew Over the Cuckoo's Nest</td>\n",
              "      <td>Milos Forman</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>196</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "      <td>Keanu Reeves</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>197</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "      <td>Nancy Meyers</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>198</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "      <td>Diane Keaton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>199</th>\n",
              "      <td>Something's Gotta Give</td>\n",
              "      <td>Jack Nicholson</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>200</th>\n",
              "      <td>Bicentennial Man</td>\n",
              "      <td>Robin Williams</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>201</th>\n",
              "      <td>Bicentennial Man</td>\n",
              "      <td>Oliver Platt</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>202</th>\n",
              "      <td>Bicentennial Man</td>\n",
              "      <td>Chris Columbus</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>203</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "      <td>Julia Roberts</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>204</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "      <td>Mike Nichols</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>205</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>206</th>\n",
              "      <td>Charlie Wilson's War</td>\n",
              "      <td>Philip Seymour Hoffman</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>207</th>\n",
              "      <td>The Polar Express</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>208</th>\n",
              "      <td>The Polar Express</td>\n",
              "      <td>Robert Zemeckis</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>209</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Tom Hanks</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>210</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Madonna</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>211</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Penny Marshall</td>\n",
              "      <td>DIRECTED</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>212</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Rosie O'Donnell</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>213</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Geena Davis</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>214</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Bill Paxton</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>215</th>\n",
              "      <td>A League of Their Own</td>\n",
              "      <td>Lori Petty</td>\n",
              "      <td>ACTED_IN</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                             m.title                  p.name   type(a)\n",
              "0                         The Matrix             Emil Eifrem  ACTED_IN\n",
              "1                         The Matrix          Lana Wachowski  DIRECTED\n",
              "2                         The Matrix         Lilly Wachowski  DIRECTED\n",
              "3                         The Matrix            Hugo Weaving  ACTED_IN\n",
              "4                         The Matrix      Laurence Fishburne  ACTED_IN\n",
              "5                         The Matrix        Carrie-Anne Moss  ACTED_IN\n",
              "6                         The Matrix            Keanu Reeves  ACTED_IN\n",
              "7                The Matrix Reloaded          Lana Wachowski  DIRECTED\n",
              "8                The Matrix Reloaded         Lilly Wachowski  DIRECTED\n",
              "9                The Matrix Reloaded            Hugo Weaving  ACTED_IN\n",
              "10               The Matrix Reloaded      Laurence Fishburne  ACTED_IN\n",
              "11               The Matrix Reloaded        Carrie-Anne Moss  ACTED_IN\n",
              "12               The Matrix Reloaded            Keanu Reeves  ACTED_IN\n",
              "13            The Matrix Revolutions          Lana Wachowski  DIRECTED\n",
              "14            The Matrix Revolutions         Lilly Wachowski  DIRECTED\n",
              "15            The Matrix Revolutions            Hugo Weaving  ACTED_IN\n",
              "16            The Matrix Revolutions      Laurence Fishburne  ACTED_IN\n",
              "17            The Matrix Revolutions        Carrie-Anne Moss  ACTED_IN\n",
              "18            The Matrix Revolutions            Keanu Reeves  ACTED_IN\n",
              "19              The Devil's Advocate         Taylor Hackford  DIRECTED\n",
              "20              The Devil's Advocate               Al Pacino  ACTED_IN\n",
              "21              The Devil's Advocate         Charlize Theron  ACTED_IN\n",
              "22              The Devil's Advocate            Keanu Reeves  ACTED_IN\n",
              "23                    A Few Good Men          James Marshall  ACTED_IN\n",
              "24                    A Few Good Men            Kevin Pollak  ACTED_IN\n",
              "25                    A Few Good Men              J.T. Walsh  ACTED_IN\n",
              "26                    A Few Good Men            Aaron Sorkin  ACTED_IN\n",
              "27                    A Few Good Men        Cuba Gooding Jr.  ACTED_IN\n",
              "28                    A Few Good Men       Christopher Guest  ACTED_IN\n",
              "29                    A Few Good Men              Rob Reiner  DIRECTED\n",
              "30                    A Few Good Men               Noah Wyle  ACTED_IN\n",
              "31                    A Few Good Men       Kiefer Sutherland  ACTED_IN\n",
              "32                    A Few Good Men             Kevin Bacon  ACTED_IN\n",
              "33                    A Few Good Men              Demi Moore  ACTED_IN\n",
              "34                    A Few Good Men          Jack Nicholson  ACTED_IN\n",
              "35                    A Few Good Men              Tom Cruise  ACTED_IN\n",
              "36                           Top Gun              Val Kilmer  ACTED_IN\n",
              "37                           Top Gun              Tony Scott  DIRECTED\n",
              "38                           Top Gun                Meg Ryan  ACTED_IN\n",
              "39                           Top Gun            Tom Skerritt  ACTED_IN\n",
              "40                           Top Gun          Kelly McGillis  ACTED_IN\n",
              "41                           Top Gun              Tom Cruise  ACTED_IN\n",
              "42                           Top Gun         Anthony Edwards  ACTED_IN\n",
              "43                     Jerry Maguire         Jerry O'Connell  ACTED_IN\n",
              "44                     Jerry Maguire             Bonnie Hunt  ACTED_IN\n",
              "45                     Jerry Maguire           Cameron Crowe  DIRECTED\n",
              "46                     Jerry Maguire                Jay Mohr  ACTED_IN\n",
              "47                     Jerry Maguire        Cuba Gooding Jr.  ACTED_IN\n",
              "48                     Jerry Maguire       Jonathan Lipnicki  ACTED_IN\n",
              "49                     Jerry Maguire         Renee Zellweger  ACTED_IN\n",
              "50                     Jerry Maguire           Kelly Preston  ACTED_IN\n",
              "51                     Jerry Maguire             Regina King  ACTED_IN\n",
              "52                     Jerry Maguire              Tom Cruise  ACTED_IN\n",
              "53                       Stand By Me         Jerry O'Connell  ACTED_IN\n",
              "54                       Stand By Me              Rob Reiner  DIRECTED\n",
              "55                       Stand By Me           River Phoenix  ACTED_IN\n",
              "56                       Stand By Me           Marshall Bell  ACTED_IN\n",
              "57                       Stand By Me             Wil Wheaton  ACTED_IN\n",
              "58                       Stand By Me       Kiefer Sutherland  ACTED_IN\n",
              "59                       Stand By Me             John Cusack  ACTED_IN\n",
              "60                       Stand By Me           Corey Feldman  ACTED_IN\n",
              "61                As Good as It Gets              Helen Hunt  ACTED_IN\n",
              "62                As Good as It Gets          Jack Nicholson  ACTED_IN\n",
              "63                As Good as It Gets        Cuba Gooding Jr.  ACTED_IN\n",
              "64                As Good as It Gets            Greg Kinnear  ACTED_IN\n",
              "65                As Good as It Gets         James L. Brooks  DIRECTED\n",
              "66              What Dreams May Come            Vincent Ward  DIRECTED\n",
              "67              What Dreams May Come          Robin Williams  ACTED_IN\n",
              "68              What Dreams May Come        Cuba Gooding Jr.  ACTED_IN\n",
              "69              What Dreams May Come           Max von Sydow  ACTED_IN\n",
              "70              What Dreams May Come           Werner Herzog  ACTED_IN\n",
              "71              What Dreams May Come       Annabella Sciorra  ACTED_IN\n",
              "72            Snow Falling on Cedars             Ethan Hawke  ACTED_IN\n",
              "73            Snow Falling on Cedars             Scott Hicks  DIRECTED\n",
              "74            Snow Falling on Cedars               Rick Yune  ACTED_IN\n",
              "75            Snow Falling on Cedars           Max von Sydow  ACTED_IN\n",
              "76            Snow Falling on Cedars          James Cromwell  ACTED_IN\n",
              "77                   You've Got Mail               Tom Hanks  ACTED_IN\n",
              "78                   You've Got Mail             Nora Ephron  DIRECTED\n",
              "79                   You've Got Mail            Parker Posey  ACTED_IN\n",
              "80                   You've Got Mail            Greg Kinnear  ACTED_IN\n",
              "81                   You've Got Mail                Meg Ryan  ACTED_IN\n",
              "82                   You've Got Mail              Steve Zahn  ACTED_IN\n",
              "83                   You've Got Mail          Dave Chappelle  ACTED_IN\n",
              "84              Sleepless in Seattle             Nora Ephron  DIRECTED\n",
              "85              Sleepless in Seattle                Meg Ryan  ACTED_IN\n",
              "86              Sleepless in Seattle           Victor Garber  ACTED_IN\n",
              "87              Sleepless in Seattle               Tom Hanks  ACTED_IN\n",
              "88              Sleepless in Seattle            Bill Pullman  ACTED_IN\n",
              "89              Sleepless in Seattle             Rita Wilson  ACTED_IN\n",
              "90              Sleepless in Seattle         Rosie O'Donnell  ACTED_IN\n",
              "91            Joe Versus the Volcano    John Patrick Stanley  DIRECTED\n",
              "92            Joe Versus the Volcano               Tom Hanks  ACTED_IN\n",
              "93            Joe Versus the Volcano             Nathan Lane  ACTED_IN\n",
              "94            Joe Versus the Volcano                Meg Ryan  ACTED_IN\n",
              "95              When Harry Met Sally           Carrie Fisher  ACTED_IN\n",
              "96              When Harry Met Sally           Billy Crystal  ACTED_IN\n",
              "97              When Harry Met Sally             Bruno Kirby  ACTED_IN\n",
              "98              When Harry Met Sally                Meg Ryan  ACTED_IN\n",
              "99              When Harry Met Sally              Rob Reiner  DIRECTED\n",
              "100                That Thing You Do               Tom Hanks  ACTED_IN\n",
              "101                That Thing You Do               Liv Tyler  ACTED_IN\n",
              "102                That Thing You Do         Charlize Theron  ACTED_IN\n",
              "103                That Thing You Do               Tom Hanks  DIRECTED\n",
              "104                 The Replacements          Brooke Langton  ACTED_IN\n",
              "105                 The Replacements            Keanu Reeves  ACTED_IN\n",
              "106                 The Replacements           Howard Deutch  DIRECTED\n",
              "107                 The Replacements           Orlando Jones  ACTED_IN\n",
              "108                 The Replacements            Gene Hackman  ACTED_IN\n",
              "109                       RescueDawn            Zach Grenier  ACTED_IN\n",
              "110                       RescueDawn              Steve Zahn  ACTED_IN\n",
              "111                       RescueDawn           Werner Herzog  DIRECTED\n",
              "112                       RescueDawn          Christian Bale  ACTED_IN\n",
              "113                       RescueDawn           Marshall Bell  ACTED_IN\n",
              "114                     The Birdcage          Robin Williams  ACTED_IN\n",
              "115                     The Birdcage            Mike Nichols  DIRECTED\n",
              "116                     The Birdcage             Nathan Lane  ACTED_IN\n",
              "117                     The Birdcage            Gene Hackman  ACTED_IN\n",
              "118                       Unforgiven          Clint Eastwood  ACTED_IN\n",
              "119                       Unforgiven            Gene Hackman  ACTED_IN\n",
              "120                       Unforgiven          Clint Eastwood  DIRECTED\n",
              "121                       Unforgiven          Richard Harris  ACTED_IN\n",
              "122                  Johnny Mnemonic                   Ice-T  ACTED_IN\n",
              "123                  Johnny Mnemonic              Dina Meyer  ACTED_IN\n",
              "124                  Johnny Mnemonic            Keanu Reeves  ACTED_IN\n",
              "125                  Johnny Mnemonic          Takeshi Kitano  ACTED_IN\n",
              "126                  Johnny Mnemonic            Robert Longo  DIRECTED\n",
              "127                      Cloud Atlas               Tom Hanks  ACTED_IN\n",
              "128                      Cloud Atlas           Jim Broadbent  ACTED_IN\n",
              "129                      Cloud Atlas              Tom Tykwer  DIRECTED\n",
              "130                      Cloud Atlas          Lana Wachowski  DIRECTED\n",
              "131                      Cloud Atlas             Halle Berry  ACTED_IN\n",
              "132                      Cloud Atlas            Hugo Weaving  ACTED_IN\n",
              "133                      Cloud Atlas         Lilly Wachowski  DIRECTED\n",
              "134                The Da Vinci Code               Tom Hanks  ACTED_IN\n",
              "135                The Da Vinci Code              Ron Howard  DIRECTED\n",
              "136                The Da Vinci Code            Ian McKellen  ACTED_IN\n",
              "137                The Da Vinci Code           Audrey Tautou  ACTED_IN\n",
              "138                The Da Vinci Code            Paul Bettany  ACTED_IN\n",
              "139                   V for Vendetta               John Hurt  ACTED_IN\n",
              "140                   V for Vendetta             Stephen Rea  ACTED_IN\n",
              "141                   V for Vendetta         Natalie Portman  ACTED_IN\n",
              "142                   V for Vendetta            Hugo Weaving  ACTED_IN\n",
              "143                   V for Vendetta          James Marshall  DIRECTED\n",
              "144                   V for Vendetta               Ben Miles  ACTED_IN\n",
              "145                      Speed Racer          Lana Wachowski  DIRECTED\n",
              "146                      Speed Racer            Emile Hirsch  ACTED_IN\n",
              "147                      Speed Racer         Lilly Wachowski  DIRECTED\n",
              "148                      Speed Racer                    Rain  ACTED_IN\n",
              "149                      Speed Racer         Christina Ricci  ACTED_IN\n",
              "150                      Speed Racer               Ben Miles  ACTED_IN\n",
              "151                      Speed Racer          Susan Sarandon  ACTED_IN\n",
              "152                      Speed Racer            John Goodman  ACTED_IN\n",
              "153                      Speed Racer             Matthew Fox  ACTED_IN\n",
              "154                   Ninja Assassin          James Marshall  DIRECTED\n",
              "155                   Ninja Assassin                    Rain  ACTED_IN\n",
              "156                   Ninja Assassin               Ben Miles  ACTED_IN\n",
              "157                   Ninja Assassin               Rick Yune  ACTED_IN\n",
              "158                   Ninja Assassin           Naomie Harris  ACTED_IN\n",
              "159                   The Green Mile            Sam Rockwell  ACTED_IN\n",
              "160                   The Green Mile             Bonnie Hunt  ACTED_IN\n",
              "161                   The Green Mile       Patricia Clarkson  ACTED_IN\n",
              "162                   The Green Mile          James Cromwell  ACTED_IN\n",
              "163                   The Green Mile          Frank Darabont  DIRECTED\n",
              "164                   The Green Mile               Tom Hanks  ACTED_IN\n",
              "165                   The Green Mile   Michael Clarke Duncan  ACTED_IN\n",
              "166                   The Green Mile             David Morse  ACTED_IN\n",
              "167                   The Green Mile             Gary Sinise  ACTED_IN\n",
              "168                      Frost/Nixon            Sam Rockwell  ACTED_IN\n",
              "169                      Frost/Nixon           Michael Sheen  ACTED_IN\n",
              "170                      Frost/Nixon              Ron Howard  DIRECTED\n",
              "171                      Frost/Nixon          Frank Langella  ACTED_IN\n",
              "172                      Frost/Nixon            Oliver Platt  ACTED_IN\n",
              "173                      Frost/Nixon             Kevin Bacon  ACTED_IN\n",
              "174                            Hoffa          John C. Reilly  ACTED_IN\n",
              "175                            Hoffa            Danny DeVito  DIRECTED\n",
              "176                            Hoffa            Danny DeVito  ACTED_IN\n",
              "177                            Hoffa              J.T. Walsh  ACTED_IN\n",
              "178                            Hoffa          Jack Nicholson  ACTED_IN\n",
              "179                        Apollo 13               Tom Hanks  ACTED_IN\n",
              "180                        Apollo 13              Ron Howard  DIRECTED\n",
              "181                        Apollo 13               Ed Harris  ACTED_IN\n",
              "182                        Apollo 13             Gary Sinise  ACTED_IN\n",
              "183                        Apollo 13             Kevin Bacon  ACTED_IN\n",
              "184                        Apollo 13             Bill Paxton  ACTED_IN\n",
              "185                          Twister             Jan de Bont  DIRECTED\n",
              "186                          Twister              Helen Hunt  ACTED_IN\n",
              "187                          Twister             Bill Paxton  ACTED_IN\n",
              "188                          Twister  Philip Seymour Hoffman  ACTED_IN\n",
              "189                          Twister            Zach Grenier  ACTED_IN\n",
              "190                        Cast Away              Helen Hunt  ACTED_IN\n",
              "191                        Cast Away               Tom Hanks  ACTED_IN\n",
              "192                        Cast Away         Robert Zemeckis  DIRECTED\n",
              "193  One Flew Over the Cuckoo's Nest            Danny DeVito  ACTED_IN\n",
              "194  One Flew Over the Cuckoo's Nest          Jack Nicholson  ACTED_IN\n",
              "195  One Flew Over the Cuckoo's Nest            Milos Forman  DIRECTED\n",
              "196           Something's Gotta Give            Keanu Reeves  ACTED_IN\n",
              "197           Something's Gotta Give            Nancy Meyers  DIRECTED\n",
              "198           Something's Gotta Give            Diane Keaton  ACTED_IN\n",
              "199           Something's Gotta Give          Jack Nicholson  ACTED_IN\n",
              "200                 Bicentennial Man          Robin Williams  ACTED_IN\n",
              "201                 Bicentennial Man            Oliver Platt  ACTED_IN\n",
              "202                 Bicentennial Man          Chris Columbus  DIRECTED\n",
              "203             Charlie Wilson's War           Julia Roberts  ACTED_IN\n",
              "204             Charlie Wilson's War            Mike Nichols  DIRECTED\n",
              "205             Charlie Wilson's War               Tom Hanks  ACTED_IN\n",
              "206             Charlie Wilson's War  Philip Seymour Hoffman  ACTED_IN\n",
              "207                The Polar Express               Tom Hanks  ACTED_IN\n",
              "208                The Polar Express         Robert Zemeckis  DIRECTED\n",
              "209            A League of Their Own               Tom Hanks  ACTED_IN\n",
              "210            A League of Their Own                 Madonna  ACTED_IN\n",
              "211            A League of Their Own          Penny Marshall  DIRECTED\n",
              "212            A League of Their Own         Rosie O'Donnell  ACTED_IN\n",
              "213            A League of Their Own             Geena Davis  ACTED_IN\n",
              "214            A League of Their Own             Bill Paxton  ACTED_IN\n",
              "215            A League of Their Own              Lori Petty  ACTED_IN"
            ]
          },
          "metadata": {},
          "execution_count": 54
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 143
        },
        "id": "dkcIFtE-K1s_",
        "outputId": "3714cf3b-6211-4d8c-e1cd-959008097b11"
      },
      "source": [
        "# 15. i film in cui ha recitato Tom Cruise e i rispettivi registi\n",
        "cypher_query = '''\n",
        "MATCH (tom:Person {name: \"Tom Cruise\"})-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(p:Person) \n",
        "RETURN m.title, p.name\n",
        "'''\n",
        "\n",
        "with driver.session() as graphDB_Session:\n",
        "    result = graphDB_Session.run(cypher_query).data()\n",
        "df = pd.DataFrame(result)\n",
        "df"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>m.title</th>\n",
              "      <th>p.name</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>Jerry Maguire</td>\n",
              "      <td>Cameron Crowe</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>Top Gun</td>\n",
              "      <td>Tony Scott</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>A Few Good Men</td>\n",
              "      <td>Rob Reiner</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "          m.title         p.name\n",
              "0   Jerry Maguire  Cameron Crowe\n",
              "1         Top Gun     Tony Scott\n",
              "2  A Few Good Men     Rob Reiner"
            ]
          },
          "metadata": {},
          "execution_count": 55
        }
      ]
    }
  ]
}